[
  {
    "Program Name": "Climate Policy Fellows Program",
    "Link": "https://cps-oss.ccny.cuny.edu/climatepolicyfellowsprogram/#:~:text=Fellows%20participate%20in%20four%20intensive,shapes%20these%20fields%20of%20research.",
    "Description": "Climate Policy Fellows Program - “Fellows participate in four intensive workshops led by a range of senior national and international climate policy leaders. The workshops prepare fellows to understand how science, engineering, and economics research affects public policy, and how policy-making shapes these fields of research.”",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Master in Public Administration (MPA) Program",
    "Link": "https://www.ccny.cuny.edu/psm",
    "Description": "In collaboration with the Movement for Black Lives, the students developed a guide to facilitate discussions on the invest-divest approach to public safety. This guide is designed to engage with individuals uncertain about divesting from policing and investing in an approach to public safety that serves everyone.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Leadership for Democracy and Social Justice",
    "Link": "https://www.socialjusticeleadership.org/mission",
    "Description": "Leadership for Democracy and Social Justice is an institute created and led by movement leaders with experience and investment in grassroots organizing. We support diverse cohorts of leaders from the communities at the forefront of social justice movements understand how to build lasting power and use it for our collective liberation.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Global Student Certificate",
    "Link": "https://zicklin.baruch.cuny.edu/faculty-research/centers-institutes/weissman-center-international-business/global-student-certificate/",
    "Description": "Global Student Certificate - “The GSC program is designed to increase participants’ knowledge of foreign countries and cultures, as well as develop a cross-cultural mindset that is sensitive to power differences in intercultural situations. In today’s global economy, this type of knowledge is crucial for employees to function in the global workplace.”",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Master of International Affairs (MIA) Program",
    "Link": "https://marxe.baruch.cuny.edu/homepage/academics/master-of-international-affairs/",
    "Description": "The Marxe School offers a two-year, 42-credit Master of International Affairs for a new generation of forward-thinking students committed to responsible leadership in government, global institutions, international nongovernmental organizations (INGOs) and business. The program can also be taken part-time.",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Dual Degree Programs",
    "Link": "https://zicklin.baruch.cuny.edu/academic-programs/global-zicklin/international-partners/",
    "Description": "The Zicklin School of Business has established a number of international partnerships with universities around the world at undergraduate, graduate, and executive levels, these programs include:",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Executives on Campus (EOC) Program",
    "Link": "https://www.alumni.baruch.cuny.edu/get-involved/executives-on-campus",
    "Description": "Executives on Campus (EOC) Program - “Baruch College connects undergraduate and graduate students with executive mentors who guide and develop their networking, interviewing and other essential business etiquette skills to make Baruch students competitive in today’s job market.”a",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Alumni Network Engagement",
    "Link": "https://www.alumni.baruch.cuny.edu/about",
    "Description": "We are invested in building a greater sense of Baruch pride among graduates through impactful communications and diverse programming in collaboration with our colleagues throughout the College. With the help of alumni volunteers and ambassadors, we strive to build robust alumni networks within corporations, across interests and industries, throughout New York City, and regionally throughout the U.S. and around the world.",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Global Business Education Program",
    "Link": "https://zicklin.baruch.cuny.edu/academic-programs/global-zicklin/",
    "Description": "Zicklin partners with universities around the world, from the Netherlands to China, to help you acquire critical international experience and cross-cultural skills, as well as grow on a personal level.",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "SEAMLSS Program",
    "Link": "https://www.lehman.edu/academics/health-human-services-nursing/seamlss/",
    "Description": "SEAMLSS Program -“SEAMLSS aims to help low-income students at Lehman College in achieving their college degrees. SEAMLSS provides students with a host of academic and career advisement to include finding paid internship on and off campus, professional resume writing, mock interviews to prepare for that first job, and other curricula enhancing opportunities that facilitate academic success.”",
    "Affiliations": "Lehman College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "The Lehman College ACE Program",
    "Link": "https://www.lehman.cuny.edu/ace/",
    "Description": "The Lehman College ACE Program - “ACE provides a range of financial, academic, and personal support, including intensive academic advisement and career counseling, as well as tuition, textbook, and transportation assistance.”",
    "Affiliations": "Lehman College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Integrated Design of Materials in NYC (IDMinNYC) REU Program",
    "Link": "https://dmresearchhome.com/reu.html",
    "Description": "Come and discover NYC in the Summer and engage in cutting edge research in Materials Science as a participant in our joint IDMinNYC and CREST IDEALS REU program. Work in a reseach lab at Lehman College, City College or the CUNY Advanced Science Research Center and participate in professional development workshops and some fun group activities and outings to explore NYC.",
    "Affiliations": "Lehman College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CUNY LEADS",
    "Link": "https://www.brooklyn.edu/magner/students/special-programs/cuny-leads/",
    "Description": "CUNY LEADS - “CUNY LEADS is a program that was established to facilitate positive career outcomes for students with disabilities. In addition to its services, CUNY LEADS also ensures that there are advisers on every CUNY campus as well a job developer in each borough.”",
    "Affiliations": "Brooklyn College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Brooklyn College Learning Center",
    "Link": "https://www.brooklyn.edu/lc/",
    "Description": "Brooklyn College Learning Center - “With support from the Office of Institutional Research and Data Analysis and ongoing oversight from the provost and senior vice president for academic affairs, the LC designs relevant interventions for need areas to further Brooklyn College’s efforts to stimulate student-driven learning as well as increase retention rates and on-time graduation.",
    "Affiliations": "Brooklyn College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Science Research Day",
    "Link": "https://www.brooklyn.edu/academics/research/science-research-day/",
    "Description": "We invite you and your students to take part in Brooklyn College’s 33rd annual Science Research Day on Friday, May 3, 2024. On Science Day, undergraduate and graduate students working with college faculty present judged posters on their research. This year, Science Day will be held in the Student Center. Poster presentation and viewing will take place from 10 a.m. to 1 p.m., followed by an award ceremony.",
    "Affiliations": "Brooklyn College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Brooklyn College Open Education Resources (OER)",
    "Link": "https://libguides.brooklyn.cuny.edu/oeralt",
    "Description": "Open Educational Resources (OER) are free and openly licensed educational materials that can be used for teaching, learning, research, and other purposes.The OER projects on this guide were created by Brooklyn College Faculty in coordination with the Brooklyn College Library Open Educational Initiatives group.  The OER Project began in 2014-2015, and was designed to encourage faculty experimentation and innovation using open and/or library licensed resources for their course materials. This project was continued and expanded and in 2017 became the CUNY and SUNY 2017/18 OER Initiative. Former Governor Andrew Cuomo and the NY State Legislature awarded CUNY and SUNY $8 million to implement open educational resources and to develop, enhance and institutionalize new and ongoing open educational resources across both universities.",
    "Affiliations": "Brooklyn College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Caribbean Research Center (CRC)",
    "Link": "https://www.mec.cuny.edu/centers/caribbean-research-center/",
    "Description": "Caribbean Research Center (CRC) - “Through its research efforts, the Center provides a multidisciplinary understanding of the New York social environment, the diverse social, cultural and economic characteristics of the Caribbean-American community and a comparative analysis of the immigration experience of this community in the context of the wider Caribbean Diasporas in the Americas and Europe. ”",
    "Affiliations": "Medgar Evers College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Emerging Scholars Program (ESP)",
    "Link": "https://www.citytech.cuny.edu/research/",
    "Description": "Emerging Scholars Program (ESP) - “The Emerging Scholars Program provides students with an opportunity to apply what was learned in the classroom to discover new knowledge, solve real-world problems and develop professionally while working with faculty to advance their scholarly endeavors”",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Black Male Initiative (BMI)",
    "Link": "https://www1.cuny.edu/sites/bmi/",
    "Description": "The CUNY Black Male Initiative is a university-wide student development initiative with more than 30 campus programs focused on increasing matriculation, retention and graduation rates of underrepresented students, particularly men of color. CUNY BMI is one expression of CUNY’s commitment to access and diversity. CUNY BMI campus programs are open to all academically eligible students, faculty and staff, without regard for race, gender or national origin.",
    "Affiliations": "New York City College of Technology (City Tech), CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CREAR Futuros (Creating Futures)",
    "Link": "https://www.citytech.cuny.edu/crearfuturos/",
    "Description": "In 2015 City Tech and the Human Services Department began an exciting partnership with the Hispanic Federation to bring to our campus the Crear Futuros program. Crear Futuros (Creating Futures) is a peer–mentoring program designed to bring increased attention and resources, and improve educational achievement and economic opportunity for Latinx students and others in New York City attending their first year of college in CUNY Schools. The program supports college access, retention, and increased graduation rates.",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "First Year Programs (FYP)",
    "Link": "https://www.citytech.cuny.edu/fyp/",
    "Description": "Our mission is to help students reach their academic and professional goals by welcoming them into City Tech's college community. Our faculty, staff, and peer mentors support students' transition to college, foster their academic skills, and work with them to create a successful pathway to the future. First Year Programs forwards the goals of the college by creating an inclusive environment where all students feel supported, valued, and encouraged to succeed.",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "MathStart",
    "Link": "https://www.citytech.cuny.edu/mathstart/",
    "Description": "Math Start is a highly successful zero-cost alternative to traditional developmental coursework in math that has been found to help nearly 100% of students, even those with two levels of remedial math needs, become fully college ready.",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "York College Institutional Survey",
    "Link": "https://www.york.cuny.edu/institutional-effectiveness/survey-results?activeAccordion=bdeadb0a-5a21-4760-af9a-c4175e1050fd",
    "Description": "York College Institutional Survey Results",
    "Affiliations": "York College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "LifeSci NYC Intern",
    "Link": "https://lifesci.nyc/student-application",
    "Description": "Applications for internships, part-time jobs, and full-time jobs are open year-round. For those seeking internships for summer 2025, we have a suggested early deadline of December 31, 2024, which will provide the best chance for accessing the greatest number of opportunities, and receiving preferred consideration for summer internships.",
    "Affiliations": "York College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Computational Biology Summer Program (CBSP)",
    "Link": "https://www.mskcc.org/education-training/summer-scientific-undergraduate-programs/computational-biology-summer-program-cbsp",
    "Description": "Computational Biology Summer Program -“This 10-week program is designed to bring approximately 15 outstanding computer science/applied math undergraduate rising sophomores, juniors, and seniors interested in pursuing a career at the intersection of computer science and biomedicine for a research experience on the Memorial Sloan Kettering, Weill Cornell, and Rockefeller University campuses.”",
    "Affiliations": "York College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Collegiate Science & Technology Entry Program (CSTEP)",
    "Link": "https://www.csi.cuny.edu/academics-and-research/specialized-programs/opportunity-diversity-programs/cstep",
    "Description": "Collegiate Science & Technology Entry Program - “designed to increase the number of historically underrepresented and economically disadvantaged students who enroll in and complete undergraduate and graduate programs leading to professional licensure or to careers in the fields of science, technology and education.”",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Center for Developmental Neuroscience",
    "Link": "https://www.csi.cuny.edu/academics-and-research/research-centers/center-developmental-neuroscience",
    "Description": "Welcome to the Center for Developmental Neuroscience and Developmental Disabilities (CDN) at the College of Staten Island. Faculty in the center conduct basic and clinical research in the areas of neurodevelopmental disorders, neurodegeneration and repair. The other mission is to provide outstanding education and research experience to undergraduate and graduate students.",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Social Policy Simulation Center (SPSC)",
    "Link": "http://www.cunyspsc.org/",
    "Description": "Our team is focused on exploring the multilayered social and technical interactions that occur in modern cities and their fringes. We look to analyze how to improve the functioning of these urban systems through better operational practice as well as simulate the performance of proposed projects.",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Student Jobs",
    "Link": "https://www.csi.cuny.edu/campus-life/student-jobs",
    "Description": "Student Jobs - “The College of Staten Island has developed this web page to assist students who are interested in working in on-campus positions. ”",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Big Buddy Program",
    "Link": "https://www.qc.cuny.edu/academics/ee/big-buddy-program/",
    "Description": "Big Buddy Program - “The Big Buddy Program is a youth-based service-learning and mentoring program at CUNY Queens College that is designed to foster an engaging learning and mentoring experience for college students and homeless children in an equity-based, empowering, and socially just context.”",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Center for Career Engagement and Internships",
    "Link": "https://www.qc.cuny.edu/academics/cei/",
    "Description": "Center for Career Engagement and Internships -“ provides career education to students by offering coaching, internships, jobs, and professional connections for success in a transforming global workforce.”",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "US Department of Education HSI-STEM program",
    "Link": "https://www.qc.cuny.edu/hsi-stem/",
    "Description": "The United States is not producing college graduates with STEM majors in sufficient numbers to meet workforce demands, because of disproportionate attrition in STEM among traditionally underrepresented students and inefficiencies in transferring from two-year to four-year institutions.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Office of Research and Sponsored Programs",
    "Link": "https://www.qc.cuny.edu/academics/rasp/",
    "Description": "The Office of Research and Sponsored Programs (ORSP) at Queens College, City University of New York (CUNY), reporting to the Dean of Research/Math & Natural Sciences and the Office of the Provost, assists faculty and staff with securing external funding from public and private sources for research and non-research initiatives (e.g., training, program and curriculum development, community service, conferences, etc.). ORSP assists faculty and staff in identifying funding opportunities; proposal and budget development; and application and reporting submissions.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Center for Advanced Research of Spatial Information (CARSI)",
    "Link": "https://www.hunter.cuny.edu/office-of-the-provost/academic-units/",
    "Description": "CARSI is a research facility at Hunter College in New York City. Our projects focus on the modeling and analysis of spatial information.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "The Centro de Estudios Puertorriquenos/Center for Puerto Rican Studies",
    "Link": "https://centropr.hunter.cuny.edu/",
    "Description": "The Centro de Estudios Puertorriquenos/Center for Puerto Rican Studies - “We continue documenting, preserving and disseminating our precious history to ensure a clear, authentic understanding of our communities, our contributions, and our challenges.”",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "National Center for the Study of Collective Bargaining in Higher Education and the Professions (NCSCBHEP)",
    "Link": "https://www.hunter.cuny.edu/ncscbhep",
    "Description": "National Center for the Study of Collective Bargaining in Higher Education and the Professions  -“The National Center is pleased to announce the publication of the 2024 Directory of Bargaining Agents and Contracts in Higher Education on the scope of higher education unionization involving faculty, postdoctoral scholars, and graduate and undergraduate student employees. The 2024 Directory includes data and analysis concerning over 900 collective bargaining relationships in higher education through January 1, 2024, and hyperlinks to 813 recent contracts in higher education.”",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Center for Cybercrime Studies",
    "Link": "https://ccybers.org/",
    "Description": "The objectives of the Center are three-fold.  The Center draws on cross-disciplinary expertise to: 1) conduct innovative and collaborative research on cybercrime; 2) inform policies and practices designed to investigate, respond to, mitigate, and prevent cybercrime; and 3) assist national and international public and private sectors in recognizing the changing cybercrime risk landscape, detecting cybersecurity vulnerabilities, and identifying the methods used by cybercriminals to adapt to and evade law enforcement and cybersecurity measures.",
    "Affiliations": "John Jay College of Criminal Justice",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Data Collaborative for Justice",
    "Link": "https://datacollaborativeforjustice.org/",
    "Description": "The Data Collaborative for Justice- “works with local criminal justice leaders to conduct research on the operations of the criminal legal system. This model provides an opportunity for local decision-makers to understand their data, request data analyses to inform their thinking, and identify opportunities to make operational changes and reforms.”",
    "Affiliations": "John Jay College of Criminal Justice",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Institute for Innovation in Prosecution",
    "Link": "https://www.prosecution.org/",
    "Description": "The Institute for Innovation in Prosecution at John Jay College of Criminal Justice (IIP) provides a collaborative national platform that brings together prosecutors, policy experts, and the communities they serve to promote data-driven strategies, cutting-edge scholarship, and innovative thinking.  The IIP is dedicated to criminal justice that promotes community-centered standards of safety, fairness, and dignity.",
    "Affiliations": "John Jay College of Criminal Justice",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "National Network for Safe Communities",
    "Link": "https://nnscommunities.org/",
    "Description": "The National Network for Safe Communities (NNSC), an internationally recognized action research center at John Jay College of Criminal Justice, provides proven, evidence-based, life-saving violence reduction strategies to dozens of communities across America and beyond. Our work focuses on the safety of the most vulnerable communities in the United States, Sweden, Mexico, and Brazil. NNSC’s mission is to reduce violence, build trust, and transform public safety in partnership with communities around the world . Our paradigm-shifting violence reduction work has demonstrated conclusively that within communities the overwhelming majority of residents are not dangerous; rather, the small number of chronic violent offenders are also at the most risk of being victimized themselves.",
    "Affiliations": "John Jay College of Criminal Justice",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "PRISM Undergraduate Research Program (URP)",
    "Link": "https://www.jjay.cuny.edu/research/student-research/program-research-initiatives-science-math/programs/undergraduate-research-program",
    "Description": "PRISM Undergraduate Research Program (URP)- “Early in the program, you will attend a research training workshop to better prepare you to join a lab. After the training, you write a proposal with your mentor(s) describing your research questions, the methods you will use, and your hypothesis be­fore beginning your project. With your faculty mentor(s), you receive instruction on literature searches, project design, implemen­tation, experimental sampling, data analysis, and scientific writing/presentation.”",
    "Affiliations": "John Jay College of Criminal Justice",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CREST Center for Interface Design and Engineered Assembly of Low-dimensional Systems (IDEALS II)",
    "Link": "https://idealscrest.org/aboutus/",
    "Description": "Centers of Research Excellence in Science and Technology (CREST) is a National Science Foundation (NSF) program that makes resources available to enhance the research capabilities of minority-serving institutions through the establishment of centers that effectively integrate education and research.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "U-RISE (Undergraduate Research Training Initiative for Student Enhancement) Program",
    "Link": "https://www.ccny.cuny.edu/urise",
    "Description": "The goal of the Undergraduate Research Training Initiative for Student Enhancement (U-RISE) program is to develop a diverse pool of undergraduates who complete their baccalaureate degree, and transition into and complete biomedical, research-focused higher degree programs (e.g., Ph.D. or M.D./Ph.D.). U-RISE, funded by the National Institutes of Health, is a continuation of the MARC (Maximizing Access to Research Careers) program. This federal program provides research opportunities with a faculty mentor, offers financial support in the form of a stipend and tuition assistance, travel to scientific meetings, as well as a range of other activities and support to enhance students' academic success, and preparedness & competitiveness for graduate study.  The U-RISE program is open only to undergraduates who have completed their first 2 years of study; trainees are limited to a 24-month period of support. U-RISE is an Honors program; thus trainees are expected to maintain a solid overall GPA, and to enroll in Honors Research.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "NOAA Center for Earth System Sciences and Remote Sensing Technologies (CESSRST)",
    "Link": "https://shorturl.at/eglJ9",
    "Description": "NOAA CESSRST's mission  is to educate, train and graduate a new generation of diverse and competent cadre of students, and to create a diverse and skilled workforce in NOAA (National Oceanic and Atmospheric Administration) mission-aligned STEM (Science, Technology, Engineering and Mathematics) and social science disciplines through participation in state-of-the-art research.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research Experience for Undergraduates in Biochemistry, Biophysics and Biodesign (B3)",
    "Link": "https://www.b3-reu.ccny.cuny.edu/",
    "Description": "The Biochemistry, Biophysics and Biodesign (B3) research experience for undergraduates (REU) is a National Science Foundation supported summer program at the City College of New York (CCNY).  ​10 students are embedded into faculty research labs in the Departments of Chemistry & Biochemistry, Biology, and Physics in the Science Division, the Biomedical Engineering and Chemical Engineering at the Grove School of Engineering, and the CUNY School of Medicine.  Experiences at the laboratory bench or in front of a computer are supplemented with activities to promote interactions between students, peers, senior colleagues, faculty mentors, and to expose students to science in / out of the laboratory.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "Will be updated in the winter for summer 2026 plans",
    "": ""
  },
  {
    "Program Name": "Research and Scholarship Groups (RSGs) multicultural psychology",
    "Link": "https://www.ccny.cuny.edu/psychology/research-and-scholarship-groups",
    "Description": "Dr. Anglin’s research lab uses concepts in multicultural psychology (e.g., ethnic identity, racial microaggressions, neighborhood ethnic density) to understand social determinants of racial health disparities with a particular focus on racial disparities in psychosis and psychosis risk. Members of Dr. Anglin’s RSG are involved in any of several quantitative research projects designed to determine social and environmental risk factors for attenuated psychotic symptoms in racial and ethnic minority young people, and the clinical meaning of such symptoms. Student members of this RSG can also participate in experimental studies designed to determine the physiological and psychological stress response associated with racial exclusion. Students have ample opportunities to develop their own projects in Dr. Anglin’s lab and to contribute to manuscripts using Dr. Anglin’s data.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research and Scholarship Groups (RSGs) Social Neuroscience and Psychopathology (SNAP) lab",
    "Link": "https://www.ccny.cuny.edu/psychology/research-and-scholarship-groups",
    "Description": "Normal and pathological personality characteristics are influenced by many factors: social, emotional, cognitive, psychodynamic, and neurobiological.  At Social Neuroscience and Psychopathology (SNAP) lab, we integrate these multiple levels to investigate the mechanisms of psychological disturbance and their treatment. Our lab advances a collaborative program of research at the interface of the clinical and research understanding of Borderline Personality Disorder (BPD), a condition characterized by intense concerns about abandonment, confusion about the self, emotional instability, and, for some, self-destructive and suicidal behaviors.  What is unique about our team is that we harnesses these multiple perspectives to advance our understanding of the mechanisms of psychopathology and its treatment.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research and Scholarship Groups (RSGs) the Mentalized Affectviity Scale (MAS)",
    "Link": "https://www.ccny.cuny.edu/psychology/research-and-scholarship-groups",
    "Description": "During the past two years, Dr. Jurist's RSG has focused on developing a new measure of emotions: the Mentalized Affectviity Scale (MAS). The scale delineates three aspects of emotional experience: identifying, modulating/processing, and expressing emotions.  It also examines the construct of mentalized affectivity, the capacity to understand emotions in light of one’s autobiographical memory. Some students are undertaking projects using the MAS; other students are working on other, independent projects.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research and Scholarship Groups (RSGs) Attention and Neuropsychological Development (ATT&ND) Lab",
    "Link": "https://www.ccny.cuny.edu/psychology/research-and-scholarship-groups",
    "Description": "Dr. O’Neill runs the Attention and Neuropsychological Development (ATT&ND) Lab at CCNY.  The ATT&ND Lab studies the neuropsychological and psychosocial factors that increase risk for, and moderate the trajectory of Attention-Deficit/Hyperactivity Disorder (ADHD) across the lifespan. At the group level, this highly prevalent neurodevelopmental disorder is associated with significant functional impairment across several domains.  These group-level characteristics, however, hide the incredible heterogeneity that characterizes the disorder, and that has made it extremely challenging for researchers to the identify the pathophysiology of the disorder, effective interventions that alter trajectories of the disorder, and the associated outcomes of ADHD, particularly at the level of the individual. The ATT&ND Lab uses a multi-method approach to better understand the factors that affect the course of the disorder and the difficulties experienced in key areas of functioning, including interpersonal relationships, education and employment, and physical health, with the view to inform the development of evidence-based interventions for the disorder.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research and Scholarship Groups (RSGs) INTERSECT Lab",
    "Link": "https://www.ccny.cuny.edu/psychology/research-and-scholarship-groups",
    "Description": "The INTERSECT Lab is a clinical and epidemiological research program that examines the intersection of trajectories of well-being and the urban functioning poor.  What are extraordinary events for many individuals are daily experiences in the lives of this population. And yet, while such stressors may become commonplace, they affect daily functioning and arguably long-term health outcomes.  The INTERSECT Lab adopts a multi-level approach and ecological framework to understanding the cumulative effect of these chronic and yet quotidian experiences on well-being.  We aim to examine and reassess frequently used terms such as trauma, health, family systems, and poverty to reflect the experiences that are relevant and specific to an urban marginalized population with the aim of promoting appropriate and targeted interventions and policies.  In this vein, we are redefining “extraordinary” life course phenomenon.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research and Scholarship Groups (RSGs) separation anxiety",
    "Link": "https://www.ccny.cuny.edu/psychology/research-and-scholarship-groups",
    "Description": "Dr. Finsaas is a clinical psychologist whose research focuses on separation anxiety in adulthood. Historically, separation anxiety was considered a problem of childhood. But recent research suggests that 1 in 15 people will experience separation anxiety in adulthood, many of them for the first time (as opposed to as a continuation from childhood). When experienced in adulthood, separation anxiety is associated with poorer treatment outcomes and impaired functioning, making it an important area of study with clear clinical value.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "David Mixner Fellowship",
    "Link": "https://colinpowellschool.ccny.cuny.edu/fellowships/mixner-lgbtq-equal-rights-fellowship/",
    "Description": "Launched in 2021, the David Mixner Fellowship helps students find internships at organizations leading the movement for LGBTQ+ rights and freedom. The fellowship is named for David Mixner, a lifelong political activist involved in the movements to end the Vietnam War, pass civil rights legislation, achieve nuclear disarmament, and create a humane, stigma-free, education-based and treatment-focused approach to the AIDS epidemic.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Racial Justice Fellows Program",
    "Link": "https://colinpowellschool.ccny.cuny.edu/fellowships/racial-justice/",
    "Description": "Launched in August 2020 in the wake of George Floyd’s murder and the Black Lives Matter protests, the Racial Justice Fellows Program is a joint initiative between the Colin Powell School and CCNY’s Black Studies Program, based in the Division of Humanities and the Arts. As it embarks upon its second year, the Racial Justice Fellows Program will continue to place students at the center of efforts to create systemic change, creating a pipeline for students to become deeply involved in antiracist movements. By supporting fellows financially and programmatically, we will cultivate a new generation of leaders who can help build a more just and equitable society.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Boudreau Fellows Program",
    "Link": "https://cps-oss.ccny.cuny.edu/boudreaufellows/",
    "Description": "The Boudreau Fellows Program honors the Colin Powell School’s inaugural dean, Vince Boudreau. Boudreau Fellows will be supported with mentoring, advising and opportunities to engage in special projects, as well as assistance to find professionally relevant internships in between their two years of support.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "NBCU Academy Fellows Program",
    "Link": "https://cps-oss.ccny.cuny.edu/nbcuacademy/",
    "Description": "The NBCU Academy Fellows program is designed to educate and support outstanding students who are on a path to become leaders, journalists, and content creators. Fellows will participate in intensive mentoring, professional development, and paid internships, opportunities provided to fellows by the faculty and staff of CCNY with generous financial support from NBCUniversal News Group.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Semester in D.C. Fellowship",
    "Link": "https://colinpowellschool.ccny.cuny.edu/fellowships/semester-in-dc-fellowship/",
    "Description": "The Colin Powell School’s Semester in Washington, D.C. Program offers students an outstanding opportunity to live, work, and study in the nation’s capital. Students spend the spring semester interning at a government agency or nonprofit organization while completing 12 credits, including two special courses designed just for them and taught in D.C.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Santander Finance Fellowship",
    "Link": "",
    "Description": "The Santander Finance Fellowship, a highly-selective year-long program, provides selected students the opportunity to learn advanced financial analysis and strategic problem-solving skills, be mentored by experienced finance professionals, and connect with potential employers before graduation.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Colin Powell—Bloom Energy Innovation Fellowship",
    "Link": "https://cps-oss.ccny.cuny.edu/bloomenergyfellowship/",
    "Description": "This fellowship aims to provide students with an intensive summer internship experience at Bloom Energy, a leading manufacturer in the fuel cell industry, along with professional development and a unique cohort-based experience — all while staying in California!",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Honors Program in Legal Studies",
    "Link": "https://www.ccny.cuny.edu/program-in-legal-studies",
    "Description": "Our two-year program accepts rising juniors (students who have completed approximately 50 to 70 credits), and offers merit scholarships, mentoring opportunities,  special legal studies seminars, and LSAT preparation. Students are selected through a competitive application process. Students begin the program with a Summer Institute, then enroll in our fall semester seminar. The application deadline is March 15.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Democracy Corps",
    "Link": "https://cps-oss.ccny.cuny.edu/democracy-corps-fellowship/",
    "Description": "The Democracy Corps Fellowship offers short-term internships to CCNY undergraduate students who are interested in issues pertaining to the social, economic, and political wellbeing of New York City. The Spring 2023 program will place fellows with the New York City Civic Engagement Commission (CEC) so they can educate voters in the lead-up to New York City’s June 2023 primary elections and participatory budgeting process. Fellows will build skills, gain work experience, and get paid while also strengthening the City’s democratic processes.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Moynihan Center Public Service Fellowship",
    "Link": "https://moynihancenter.ccny.cuny.edu/student-fellowship-2023/",
    "Description": "The Moynihan Public Service Fellowship supports promising undergraduate students pursuing innovative careers in public service. Moynihan Public Service Fellows receive awards totaling $10,000, take two Political Science elective courses dedicated to professional development and public service, and participate in a paid summer internship in city government or in another public service institution. The 2024–2025 Fellowship term will commence in Fall 2024.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "NYC Asylum Days of Action",
    "Link": "https://cps-oss.ccny.cuny.edu/daysofaction/",
    "Description": "The Help Center wants highly motivated, empathetic students to work one-on-one with asylum seekers on these Days of Action. Assistants will educate asylum seekers about asylum and then help them complete an asylum application. Each Asylum Application Assistant will be trained and will be supervised and supported by onsite Supervising Attorneys.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Inner Circle Journalism Fellowship",
    "Link": "https://colinpowellschool.ccny.cuny.edu/fellowships/inner-circle-jorunalism-fellowship/",
    "Description": "The Inner Circle Journalism Fellowship will be awarded to four full-time CCNY undergraduate students during the 2024-2025 academic year. Each fellow will receive a $1,000 stipend. This fellowship focuses on the professional development of student’s interests in journalism and politics. Students participate in career-focused programming while taking classes to further their understanding in journalism and political job fields.",
    "Affiliations": "The City College of New York (CCNY)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Cold Spring Harbor Laboratory Summer Undergraduate Research Program",
    "Link": "https://www.cshl.edu/education/undergraduate-research-program/",
    "Description": "The Undergraduate Research Program (URP) at CSHL provides an opportunity for undergraduate scientists from around the world to conduct first-rate research. Students learn the scientific process, technical methods and theoretical principles, and communicate their discoveries to other scientists. Approximately 20 students come to CSHL each summer for the program, living and working in the exciting Laboratory environment.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Rockefeller University Summer Undergraduate Research Fellowship",
    "Link": "https://www.rockefeller.edu/education-and-training/surf/application-information/",
    "Description": "The Chemers Neustein Summer Undergraduate Research Fellowship (SURF) program at The Rockefeller University is designed to provide qualified, highly motivated college students majoring in the life or physical sciences, an opportunity to experience laboratory research. Each year, outstanding college sophomores and juniors are chosen from a large pool of applicants. SURF students are matched according to their stated field of interest with faculty, postdoctoral researchers or graduate students. These mentors volunteer to help design and supervise individualized summer projects for their students. The 25 students accepted into the SURF program will receive a stipend of $6,500.00 for the 10-week period of June 2 through August 8, 2025. International students are eligible to apply. Free housing will be provided for students who cannot commute.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "NYU Langone Health Summer Undergraduate Research Program",
    "Link": "https://med.nyu.edu/research/vilcek-institute-graduate-biomedical-sciences/summer-undergraduate-research-program",
    "Description": "At NYU Grossman School of Medicine, our Vilcek Institute of Graduate Biomedical Sciences offers qualified college students who have completed their sophomore or junior year the opportunity to participate in our Summer Undergraduate Research Program, also known as SURP. If you are interested in pursuing a PhD or MD/PhD in the biomedical sciences, our research internship program can provide you with an inside glimpse into life beyond your undergraduate studies.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Weill Cornell Medical College Gateways to the Laboratory",
    "Link": "https://mdphd.weill.cornell.edu/summer-program",
    "Description": "The mission of the Gateways to the Laboratory Program is to increase the number of students from backgrounds underrepresented in medicine and science who are prepared to become competitive applicants, successful MD-PhD students, and future leaders in biomedical research and academic medicine.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Einstein Summer Undergraduate Research Program (SURP)",
    "Link": "https://einsteinmed.edu/education/phd/the-summer-undergrad-research-program.aspx",
    "Description": "Each summer the Einstein Summer Undergraduate Research Program (SURP) brings together 50 college students for a one-of-a-kind opportunity to conduct laboratory research at one of the world's top-ranking scientific institutions. The program is designed for undergraduates with a strong background in science who are considering a research career.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "TIME 2000",
    "Link": "https://www.qc.cuny.edu/academics/seys/time-2000/",
    "Description": "TIME 2000 (Teaching Improvements through Mathematics Education) is a four-year secondary mathematics teacher-preparation program offering scholarships towards tuition. Participants are part of a close-knit learning community in which they take their mathematics and education courses together, engage in study groups, and attend seminars, conferences, and off-campus events. Close guidance and support are provided by carefully selected faculty who teach in the program. Students in this program major in mathematics education. Upon graduation and completion of New York State examinations, students are fully qualified to begin teaching mathematics in grades 7 through 12.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Icahn School of Medicine at Mount Sinai Summer Undergraduate Research Program",
    "Link": "https://icahn.mssm.edu/education/admissions/graduate-education/summer-undergraduate",
    "Description": "The Summer Undergraduate Research Program for Underserved Scholars (SURP4US) is an ideal program for passionate undergraduates from underserved and/or socioeconomically disadvantaged groups, with a strong interest in biomedical research and pursuing a career in the field. The Program allows students to gain valuable skills and hands-on research experience in preparation for a competitive PhD and MD-PhD program.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "Pending evaluation in January",
    "": ""
  },
  {
    "Program Name": "NIMH (National Institute of Mental Health) Summer Internship Program",
    "Link": "https://www.nimh.nih.gov/research/research-conducted-at-nimh/scientific-director/office-of-fellowship-and-training/fellowships-and-training-programs/summer-internship-program-sip",
    "Description": "The Summer Internship Program (SIP) in Biomedical Research is open to high school, college and graduate students who are interested in pursuing careers in biomedical research. The goal of this program is to match student research interests with a basic neuroscience laboratory or clinical branch where those interests might be pursued. Participants work a minimum of eight weeks between May and September with established investigators, receive training in research procedures and conduct research in selected areas of investigation under the guidance of an assigned preceptor. To be eligible to participate, students must be either U.S. citizens or permanent residents. For more information, prospective applicants should contact Aneka Reid.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Google Summer of Code (GSoC)",
    "Link": "https://summerofcode.withgoogle.com/",
    "Description": "Since 2005, GSoC has welcomed thousands of new developers into the open source community every year. The GSoC program has brought together over 20,000 contributors from 116 countries and 19,000 mentors from 850+ open source organizations.  This year we have added more projects focused on Artificial Intelligence, Machine Learning and Security than ever before; keep in mind the following points before applying:  Consider the three project sizes: ~90 hours, ~175 hours, and ~350 hours and choose which time commitment is best for you. Contributors can submit a maximum of 3 project proposals (to different orgs or even multiple proposals to the same org).",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CodePath Tech Prep",
    "Link": "https://www.codepath.org/tech-fellow-program",
    "Description": "CodePath is hiring ambassadors at select schools. Become a CodePath Tech Fellow and master your technical skills, become a local ambassador at your campus, and actively advance CodePath's mission - to diversify the tech industry at scale.",
    "Affiliations": "Queens College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research Conference",
    "Link": "https://www.hunter.cuny.edu/student-engagement-initiatives/undergraduate-research-conference/2026-research-conference/",
    "Description": "Hunter College is pleased to announce our Undergraduate Research Conference. The conference provides a forum for Hunter undergraduates to present their research and creative activities to the college as a whole. Students from all disciplines—from the arts, humanities, social sciences, natural sciences, and mathematics—are welcome to submit proposals. The conference will include scholarly feedback for participants, raffles for prizes, and a panel on pursuing research opportunities.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Stanford/Hunter Summer Program",
    "Link": "https://hunter.cuny.edu/student-engagement-initiatives/stanford-hunter-summer-program/",
    "Description": "Hunter College announces the return of our summer research exchange program. The Stanford/Hunter Summer Program is designed for students who wish to develop an independent research project and are considering graduate school, ideally a PhD program, in one of the Humanities disciplines.  As many as five Hunter College humanities students will spend eight weeks on the beautiful campus of Stanford University in Palo Alto, California. Stanford will match each Hunter student with a Stanford faculty member who will mentor the student as they develop their research project. Students will also participate in a weekly seminar on the graduate application process and research in the Humanities. This is an ideal opportunity for students to lay the groundwork for a senior-year capstone project. Or it can be a great opportunity to expand a project that students have worked on at Hunter, but want to take to another level. And to do it all in California!",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Pre-Business Advising",
    "Link": "https://www.hunter.cuny.edu/prebusiness",
    "Description": "Pre-Business advising provides students and alumni information about business school and careers in business, and advice on business school preparation and applications, as well as many other services.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Pre-Law Program",
    "Link": "https://www.hunter.cuny.edu/prelaw",
    "Description": "The Pre-Law Program advises on coursework, resume-building, and law school applications. The office also hosts events about careers and provides other resources. Alumni welcome.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Pre-Health Advising",
    "Link": "https://www.hunter.cuny.edu/prehealth",
    "Description": "If you plan on entering the health professions as a physician, dentist, podiatrist, optometrist or veterinarian, the Pre-Health Office offers information, opportunities, and support.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Pre-Social Work",
    "Link": "http://sssw.hunter.cuny.edu/",
    "Description": "For students involved in becoming social workers, the Silberman School of Social Work offers advising, programs, and resources.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Pre-Nursing Advising",
    "Link": "https://www.hunter.cuny.edu/nursing/admissions/undergraduate/advising",
    "Description": "Pre-Nursing students are offered advising and information sessions by programs of interest, such as the Generic BS, RN-to-BS, and Accelerated Second-Degree programs.",
    "Affiliations": "Hunter College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CSI UNDERGRADUATE CONFERENCE Research, Scholarship, and the Arts",
    "Link": "",
    "Description": "The annual conference on research, scholarship, and the arts is one of the hallmarks of the spring semester at CSI. The 2024 Undergraduate Conference marks our twenty-third year! This event highlights scholarly and creative projects by students majoring in all disciplines, showcasing academic excellence through student-faculty collaboration, offering a rewarding and educational experience for all.",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CUNY High Performance Computing Center (HPCC)",
    "Link": "https://www.csi.cuny.edu/academics-and-research/research-centers/cuny-high-performance-computing-center",
    "Description": "The CUNY High Performance Computing Center (HPCC) advances the University’s educational and research mission by providing high-performance computing technology resources and technical assistance to CUNY faculty and students.",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "NMR Facility",
    "Link": "https://www.csi.cuny.edu/academics-and-research/departments-programs/chemistry/nmr-laboratory",
    "Description": "Nuclear Magnetic Resonance spectroscopy (NMR) is a powerful technique that can provide information on molecular structure and dynamics at the atomic level. It has been widely used in chemistry, polymer and biology. The NMR facility at the College of Staten Island has two Varian high-field multinuclear spectrometers, Inova 600 and a 300 wide-bore. The Inova 300 is configured with a 5mm 2RF channel PFG probe tuned to 1H, 13C, 31P and other X-nuclei. It also can be configured with varian 7mm CP/MAS probe or DOTY XC-5 probe for solid materials investigation. The Inova 600 is usually configured with 5mm HCN cryoprobe in order to investigate structure and dynamics of biological macromolecules.",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Study abroad with the College of Staten Island",
    "Link": "https://www.csi.cuny.edu/campus-life/student-services/center-global-engagement/study-abroad",
    "Description": "The College of Staten Island (CSI) offers a wide range of study abroad and exchange programs. All of our study abroad programs enable you to explore both the traditions and the modern realities of the world from another perspective.  CSI's programs are open to all students at CSI, CUNY, and at other colleges and universities in the U.S. CSI is also a proud founding member of the College Consortium for International Studies (CCIS) offering programs throughout the world.",
    "Affiliations": "College of Staten Island",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CUNY Research Scholars Program (CRSP)",
    "Link": "https://www.citytech.cuny.edu/research1/docs/fall2024/CRSP_LSAMP_Application_Part%20II_Fall%202024.pdf",
    "Description": "The CUNY Research Scholars Program provides funded laboratory experiences for associate degree students (or baccalaureate students with less than 50 credits completed) over a one-year period. The goal of the program is to encourage undergraduate students to participate in authentic research and to increase persistence in STEM disciplines.",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CUNY Immersive Research Experience (CIRE)",
    "Link": "https://www.cuny.edu/research/research-development-programs/student-programs/cire/",
    "Description": "The CUNY Immersive Research Experience (CIRE) provides funded research experiences for baccalaureate degree students over a one-year period. Full-time rising junior and rising seniors in qualifying STEM programs may participate. Students and faculty should commit to being part of the program for one full academic year plus the summer. Students must maintain full-time enrollment status while in the program. The goal of the program is to encourage undergraduate participation in authentic research, to increase persistence in STEM disciplines (including social and behavioral sciences), and to prepare advanced undergraduate students for graduate programs and the professional workforce.",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "HASTAC Scholars Program",
    "Link": "https://urldefense.com/v3/__https:/hastac.us9.list-manage.com/track/click?u=de55144f8e3d2c11c5d286aec&id=a3947e1db8&e=371abb460b__;!!Lty91_B-8v6fjw!WxonrGTQAh74vzSriL0pBS3blE40xAYSC677NdXjF1zTTFg4ACS4ByAs96HsUpgbFHiRmfvvRrG1bcPYG1KryyI$",
    "Description": "Great News! We are extending the application deadline for the 2025-2026 HASTAC Scholars Program! HASTAC Scholars is a dynamic community of graduate and undergraduate students working across the intersections of technology, arts, humanities, and sciences. Scholars engage in collaborative projects, lead discussions, contribute to online forums, and showcase their research through various digital platforms. Open to students from all disciplines, the program offers a unique opportunity to connect globally, develop innovative projects, and help shape equitable educational systems.",
    "Affiliations": "New York City College of Technology (City Tech)",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Honors Thesis Guide",
    "Link": "https://provost.baruch.cuny.edu/wp-content/uploads/sites/5/2019/11/Honors_Thesis_Guidelines_2017__DR1.pdf",
    "Description": "follow a passion and become an “expert” in a specific  topic build your credentials and  create a favorable impression on future employers and graduate schools strengthen writing and research skills and foster relationships with faculty members expose yourself to the research process and enhance your abilities as a consumer of research earn departmental honors, an additional distinction on your diploma",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research & Creative Inquiry EXPO",
    "Link": "http://www.baruch.cuny.edu/CID",
    "Description": "Students are encouraged to undertake independent research, such as an Honors Thesis or research under the supervision of a faculty member. Students can also work with a faculty member for pay or for credit.",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Macaulay Research Assistantship Program",
    "Link": "https://macaulay.cuny.edu/after-macaulay/career-development/research-assistantships/",
    "Description": "This is an opportunity afforded exclusively to Macaulay Honors College students! Participants in the Research Assistantship Program connect with CUNY faculty from across the CUNY system, across the disciplines, to gain invaluable experience. Research assistants work closely with research professionals, learn research techniques appropriate to their discipline, and gain access to opportunities that may lead to formal presentations at conferences or having work published in print or digital media.",
    "Affiliations": "Baruch College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Astronomy Research Experiences for Undergraduates Sites (AST REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/ast-reu-sites-astronomy-research-experiences-undergraduates-sites",
    "Description": "The NSF-wide REU Sites program is governed by a single solicitation but administered individually by each NSF Division or Directorate. An REU Site should provide research opportunities with a coherent intellectual theme and may be based in a single discipline or academic department or may be interdisciplinary and multi-departmental.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "BIO Research Experience for Undergraduates Sites (BIO REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/bio-reu-sites-bio-research-experience-undergraduates-sites",
    "Description": "The Directorate for Biological Sciences (BIO) participates in the NSF-wide REU program. The Division for Biological Infrastructure (DBI) manages the REU Site program for BIO.  The NSF-wide Research Experiences for Undergraduates (REU) solicitation governs the overall competition. The following clarifications/explanations are specifically for REU Site proposals submitted to the BIO/DBI.    A BIO-funded REU Site hosts on average 10 students for a summer program lasting approximately 10 weeks long. In BIO, at least 50% of participants must come from outside the host institution. Stipend, meal allowance and travel to and from the REU site must be budgeted. A small research allowance of $1,000-2,000 per student can be added to Participant Support costs. Travel to conferences to present student research should NOT be included in the budget. Travel funds to students are provided through a Travel Award system administered in the https://bioreu.org website. Over the past several years, Site awards to institutions have the predominant costs under the Participant Support Costs (PSC); typically, PSC constitute 90% or more of the Total Direct Costs. Most awards provide 3 years of funding. Proposers wanting to request more than 3 years of support should contact the Program Directors. Assessment of BIO-funded REU Sites is done using the Student Assessment of Their Learning Gains Undergraduate Research Student Self-Assessment (SALG URSSA) tool (see the https://bioreu.org website for details).",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Chemistry Research Experiences for Undergraduates Sites (CHE REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/che-reu-sites-chemistry-research-experiences-undergraduates-sites",
    "Description": "The Division of Chemistry's REU program is part of an NSF-wide program under a single solicitation administered individually by each NSF Directorate and/or Division. In the Mathematical and Physical Sciences Directorate, each Division administers the program. An REU Site should provide research opportunities with a coherent intellectual theme and may be based in a single discipline or academic department or be interdisciplinary and multi-departmental.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "CISE Research Experiences for Undergraduates Sites (CISE REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/cise-reu-sites-cise-research-experiences-undergraduates-sites",
    "Description": "The Directorate for Computer and Information Science and Engineering (CISE) participates in the NSF-wide Research Experiences for Undergraduates (REU) program. The Division of Computer and Network Systems (CNS) manages the REU Site program for CISE. An REU Site should provide research opportunities with a coherent intellectual theme and may be based in a single discipline or academic department or be interdisciplinary and multi-departmental.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Mathematical Sciences Research Experiences for Undergraduates Sites (DMS REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/dms-reu-sites-mathematical-sciences-research-experiences-undergraduates",
    "Description": "The NSF-wide REU Sites program is governed by a single solicitation but administered individually by each NSF Division or Directorate. An REU Site should provide research opportunities with a coherent intellectual theme and may be based in a single discipline or academic department or be interdisciplinary and multi-departmental.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "OCE Research Experiences for Undergraduates Sites (OCE REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/oce-reu-sites-oce-research-experiences-undergraduates-sites",
    "Description": "The REU Sites program in the Division of Ocean Sciences is part of an NSF-wide program under a single solicitation administered individually by each NSF Directorate and/or Division. In the Geosciences Directorate, each Division administers the program. An REU Site should provide research opportunities with a coherent intellectual theme and may be based in a single discipline or academic department or be interdisciplinary and multi-departmental.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Research Experiences for Teachers: Supplement Opportunity (RET)",
    "Link": "https://new.nsf.gov/funding/opportunities/ret-research-experiences-teachers-supplement-opportunity",
    "Description": "The purpose of Research Experiences for Teachers (RET) activities is to facilitate professional development of K-12 science teachers through research experience at the cutting edge of science. The Directorate is particularly interested in encouraging its researchers to build mutually rewarding partnerships with teachers at inner city schools and less well endowed school districts. RET is described in the Research Experiences for Undergraduates (REU) Solicitation (most recent solicitation found at http://www.nsf.gov/funding/pgm_summ.jsp?pims_id=5517&org=BIO&sel_org=BIO&from=fund)  See the Dear Colleague Letter NSF 18-089 for opportunity announcement.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "SBE Research Experiences for Undergraduates Sites (SBE REU Sites)",
    "Link": "https://new.nsf.gov/funding/opportunities/sbe-reu-sites-sbe-research-experiences-undergraduates-sites",
    "Description": "The SBE REU Sites program is part of an NSF-wide program under a single solicitation administered individually by each Directorate. The SBE Office of Multidisciplinary Activities (SMA) receives REU Site proposals for the entire SBE Directorate and runs the competition. An REU Site should provide research opportunities with a coherent intellectual theme and may be based in a single discipline or academic department, or be interdisciplinary and multi-departmental.",
    "Affiliations": "Baruch College, CUNY-wide",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Public Interest Technology Data Science Corps (PIT-DSC)",
    "Link": "https://www.lehman.edu/academics/natural-social-sciences/student-research-opportunites/?utm_source=chatgpt.com",
    "Description": "An 8-week summer URE program that brings Columbia University and Lehman College undergraduates together to work on public interest technology projects. Graduate students from the Columbia Department of Statistics serve as mentors. Open to currently enrolled students and recent graduates.",
    "Affiliations": "Lehman College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  },
  {
    "Program Name": "Air Force Research Laboratory (AFRL) Scholars Program",
    "Link": "https://afrlscholars.usra.edu/scholarsprogram/",
    "Description": "The Air Force Research Laboratory (AFRL) Scholars Program offers stipend-paid internship opportunities for undergraduate and graduate-level university students pursuing STEM degrees, as well as upper-level high school students; select locations also offer internships to university students pursuing education-related degrees and K–12 professional educators. The selected interns gain valuable hands-on experiences working with full-time AFRL scientists and engineers on cutting-edge research and technology and are able to contribute to unique, research-based projects. Graduate interns are able to collaborate with AFRL on current research and incorporate the research into their graduate work.",
    "Affiliations": "Lehman College",
    "Valid": "Valid",
    "Notes": "",
    "": ""
  }
]
