[
  {
    "Name of the Internship": "NAVAL RESEARCH ENTERPRISE INTERNSHIP PROGRAM",
    "Description of Internship": "The goals of NREIP are to encourage participating college students to pursue science and engineering careers, to further education via mentoring by laboratory personnel and their participation in research, and to make them aware of DoN research and technology efforts, which can lead to employment within the DoN.",
    "Online link to internship": "https://www.navalsteminterns.us/nreip/",
    "Location": "Department of nanvy laboratory/ remote",
    "Deadline": "11/1/2025",
    "Associated institution": "NASA Goddard Institute for Space Studies (GISS)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Achieving Competence in Computing, Engineering, and Space (ACCESS)",
    "Description of Internship": "Providing opportunities for outstanding scientists and engineers to learn first-hand about federal policymaking while using their knowledge and skills to address today’s most pressing societal challenges.",
    "Online link to internship": "https://fellowshipapp.aaas.org/app/main/register",
    "Location": "Washington D.C.",
    "Deadline": "11/1/2025",
    "Associated institution": "American Association for the Advancement of Science (AAAS)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Scientific Summer Scholars Program",
    "Description of Internship": "Imagine performing research at a leading global pharmaceutical corporation while gaining practical experience and contributing to the search for new disease therapies. Through scientific research programs at the Novartis Institutes for BioMedical Research (NIBR), your contribution to the search for new disease therapies can begin early in your scientific education journey. Our programs are designed to introduce talented students and recent graduates to drug discovery together with rigorous research training in this area.",
    "Online link to internship": "https://www.novartis.com/careers/students-scholars",
    "Location": "Cambridge, Massachusetts",
    "Deadline": "12/1/2025",
    "Associated institution": "Novartis Institutes for BioMedical Research (NIBR)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Program For Undergraduate Research (SPUR)",
    "Description of Internship": "The purpose of SPUR is to provide undergraduate students with an intensive 10-week research experience under the mentorship of a University of Utah faculty member. The program provides opportunities to gain research experience in a variety of disciplines.",
    "Online link to internship": "https://our.utah.edu/spur/",
    "Location": "Salt Lake City, Utah",
    "Deadline": "12/1/2025",
    "Associated institution": "The University of Utah",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Janelia Undergraduate Scholars",
    "Description of Internship": "The Janelia Undergraduate Scholars program is a 10-week summer program aimed at well-prepared, independent, and committed students with significant research experience. Janelia is a highly collaborative setting where biologists routinely work alongside computer scientists, engineers, physicists, and chemists. This enables undergraduate scholars to benefit from an unparalleled interdisciplinary experience.",
    "Online link to internship": "https://www.janelia.org/you-janelia/students-and-postdocs/janelia-summer-undergraduate-research-program",
    "Location": "Ashburn, Virginia",
    "Deadline": "12/12/2025",
    "Associated institution": "Janelia Research Campus",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "LifeSci NYC Internship Program",
    "Description of Internship": "The growth of New York City’s life sciences industry depends on attracting and retaining a steady stream of qualified talent to start companies and fill essential roles, especially as New York City’s $500 million investment is projected to create 16,000 high-paying jobs in the industry. Thus, the City has a vested interest in preparing a diverse range of New York City students for careers in the life sciences sector.",
    "Online link to internship": "https://lifesci.nyc/internship",
    "Location": "NYC",
    "Deadline": "12/21/2025",
    "Associated institution": "Life Sci NY",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "AAAS Mass Media Science & Engineering Fellows",
    "Description of Internship": "Students can join AAAS as a member to strengthen the voice of science. This 10-week summer program places science, engineering, and mathematics students at media organizations nationwide. Fellows use their academic training as they research, write, and report today’s headlines, sharpening their abilities to communicate complex scientific issues to the public.",
    "Online link to internship": "https://www.aaas.org/programs/mass-media-fellowship",
    "Location": "Washington D.C.",
    "Deadline": "1/1/2026",
    "Associated institution": "American Association for the Advancement of Science (AAAS)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Research Internship Programs in Cancer Science",
    "Description of Internship": "An internationally-renowned research institution, and one of a select number of nationally designated Comprehensive Cancer Centers in the country. Our multidisciplinary focus means a unique immersion in cancer science that makes impacts in advancement of cancer healthcare and delivery you won’t find anywhere else.There is an opportunity for current Sophomores enrolled in CSTEP Programs to participate in two summer's of funded research under the R25 Summer Research Experience Program.",
    "Online link to internship": "https://www.roswellpark.org/education/k-12-undergrad/college-summer-program",
    "Location": "Buffalo, New York",
    "Deadline": "1/2/2026",
    "Associated institution": "Roswell Park Cancer Institute",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The U.S. Department of Energy’s (DOE) Science Undergraduate Laboratory Internship (SULI)",
    "Description of Internship": "The SULI program is intended to support the intellectual and professional development of students who have the desire to be involved in an intensive scientific research experience. Be part of a Department of Energy (DOE) team that’s working together to advance scientific impact and discovery. Expand your skills and knowledge at a DOE national laboratory using state-of-the-art facilities and advanced scientific instruments.",
    "Online link to internship": "https://science.osti.gov/wdts/suli/How-to-Apply",
    "Location": "DOE Laboratory/Facility",
    "Deadline": "1/7/2026",
    "Associated institution": "DOE Laboratory/Facility",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "U.S. Dept. of Energy Science Undergraduate Laboratory Internships (SULI)",
    "Description of Internship": "Selected students participate as interns appointed at one of 17 participating DOE laboratories/facilities. They perform research, under the guidance of laboratory staff scientists or engineers, on projects supporting the DOE mission.",
    "Online link to internship": "https://science.osti.gov/wdts/suli",
    "Location": "Various locations",
    "Deadline": "1/7/2026",
    "Associated institution": "U.S. Dept. of Energy Facilities",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Community College Internships (CCI)",
    "Description of Internship": "The Community College Internships (CCI) program seeks to encourage community college students to enter technical careers relevant to the DOE mission by providing technical training experiences at the DOE laboratories. Selected students participate as interns appointed at one of 16 participating DOE laboratories. They work on technologies or instrumentation projects or major research facilities supporting DOE’s mission, under the guidance of laboratory staff scientists or engineers.",
    "Online link to internship": "https://science.osti.gov/wdts/cci",
    "Location": "different labratories",
    "Deadline": "1/7/2026",
    "Associated institution": "U.S. Department of Energy",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Science Undergraduate Laboratory Internships (SULI)",
    "Description of Internship": "The Science Undergraduate Laboratory Internships (SULI) program encourages undergraduate students and recent graduates to pursue science, technology, engineering, and mathematics (STEM) careers by providing research experiences at the Department of Energy (DOE) laboratories. Selected students participate as interns appointed at one of 17 participating DOE laboratories/facilities. They perform research, under the guidance of laboratory staff scientists or engineers, on projects supporting the DOE mission.",
    "Online link to internship": "https://science.osti.gov/wdts/suli",
    "Location": "different labratories",
    "Deadline": "1/7/2026",
    "Associated institution": "U.S. Department of Energy",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research in Engineering (SURE)",
    "Description of Internship": "This program is designed to provide outstanding undergraduates with the opportunity to pursue research under the tutelage of experienced faculty members. Students work with a faculty member on a project of mutual interest for 8 weeks during the summer. There are no set dates or topics, students are selected to participate in the program based on their research interests and mathematical background.",
    "Online link to internship": "https://me.engin.umich.edu/academics/undergrad/sure/",
    "Location": "Ann Arbor, Michigan",
    "Deadline": "1/9/2026",
    "Associated institution": "University of Michigan, BioPhysics",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Caltech WAVE Fellows Program",
    "Description of Internship": "Applications will be evaluated by Caltech faculty, which will select prospective fellows from the applicant pool. Selected students will be matched with a mentor. Fellowships will be offered when the match has been confirmed.",
    "Online link to internship": "https://sfp.caltech.edu/undergraduate-research/programs/wavefellows/application_information",
    "Location": "Caltech",
    "Deadline": "1/9/2026",
    "Associated institution": "California Institute of Technology",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The MagLab's prestigious Research Experiences for Undergraduates (REU)",
    "Description of Internship": "The MagLab REU program offers a wide range of research experiences in physics, chemistry, biological sciences, geochemistry, materials science and magnet science and engineering. Participants work closely with MagLab mentors on a research project. Students also participate in weekly seminars and colloquia that broaden their knowledge of MagLab research and future careers.",
    "Online link to internship": "https://nationalmaglab.org/education/college-students-early-career-scientists/reu",
    "Location": "Los Alamos, NM.",
    "Deadline": "1/9/2026",
    "Associated institution": "Natinal High Magnetic field Laboratory",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Caltech LIGO SURF (Summer Undergraduate Research Fellowships)",
    "Description of Internship": "Undergraduate students in physics, astronomy and engineering are invited to participate in the development of gravitational-wave astronomy through the Caltech LIGO Summer Undergraduate Research Fellowships (SURF) program.",
    "Online link to internship": "https://labcit.ligo.caltech.edu/LIGO_web/students/SURF/",
    "Location": "Pasadena, California (LIGO observatory sites)",
    "Deadline": "1/11/2026",
    "Associated institution": "California Institute of Technology, LIGO Hanford Observatory, LIGO Livingston Observatory",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Stanford SURGE (Summer Undergraduate Research in Geoscience and Engineering)",
    "Description of Internship": "SURGE provides undergraduates from a U.S. institution the opportunity to gain mentored research experience at Stanford University in the geosciences and engineering during the eight-week period of June 20, 2022 to August 12, 2022. The underlying philosophy of SURGE is to train students by creating a supportive and rigorous work environment.",
    "Online link to internship": "https://sustainability.stanford.edu/our-community/access-belonging-community/surge",
    "Location": "Stanford University",
    "Deadline": "1/11/2026",
    "Associated institution": "Stanford University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Broad Summer Research Program (BSRP)",
    "Description of Internship": "The Broad Summer Research Program (BSRP) is an intensive nine-week summer research opportunity designed for undergraduates with a commitment to biomedical research and an interest in genomics. BSRP has a strong record of success in helping students to nurture their passion for research and succeed in graduate school and scientific careers. Students spend the summer performing original computational or experimental-based research in labs across the Broad's research areas, from cancer to infectious disease to computational biology.",
    "Online link to internship": "https://www.broadinstitute.org/bsrp/broad-summer-research-program-bsrp",
    "Location": "Cambridge, Massachusetts",
    "Deadline": "1/11/2026",
    "Associated institution": "MIT and Harvard",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Training Academy for Research Success (STARS",
    "Description of Internship": "The University of California, San Diego Summer Training Academy for Research Success (STARS) program is an eight-week summer research academy for community college students, undergraduate students, recent college graduates, and masters students. Opened to all disciplines, STARS offers student participants a rigorous research opportunity with esteemed UC San Diego faculty, informative transfer and graduate school preparation workshops, and educational, cultural, and social activities in sunny San Diego.",
    "Online link to internship": "https://grad.ucsd.edu/diversity/oar2/programs/undergraduate-programs/stars/stars-application.html",
    "Location": "San Diego, California",
    "Deadline": "1/12/2026",
    "Associated institution": "UC San Diego",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate Research Program (URP)",
    "Description of Internship": "All URP students undertake an original research project, mentored by one of CSHL’s outstanding research faculty. Students have access to the Lab’s state-of-the-art research facilities, including extensive resources for genomics and microscopy. At the end of the Program, students write a scientific manuscript about their summer work. Some of these become part of peer-reviewed scientific publications.",
    "Online link to internship": "https://www.cshl.edu/education/undergraduate-research-program/",
    "Location": "Cold Spring Harbor, New York",
    "Deadline": "1/15/2026",
    "Associated institution": "Cold Spring Harbor Laboratory",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Nano-, Bio-, and Quantum Photonics at University of Rochester",
    "Description of Internship": "This program will engage participating students in the frontiers of photonics research in nanoscience, bioscience and quantum science while at the same time providing them with experiences to recognize the excellent career opportunities, both academic and industry based, available in photonics. The host department is the university’s world-renowned Institute of Optics, located in the Hajim School of Engineering and Applied Sciences.",
    "Online link to internship": "https://www.hajim.rochester.edu/optics/undergraduate/reu.html",
    "Location": "Rochester, NY",
    "Deadline": "1/15/2026",
    "Associated institution": "The University of Rochester",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Fellowship Program",
    "Description of Internship": "Engage in research this summer on Purdue's West Lafayette, Indiana campus! SURF matches undergraduates with a faculty member and graduate student mentor who introduce them to the research tools used on the cutting edges of science, engineering, and technology. (Open to Purdue students and undergraduate students enrolled at U.S. colleges and universities.)",
    "Online link to internship": "https://engineering.purdue.edu/Engr/Research/EURO/students/about-SURF",
    "Location": "West Lafayette, Indiana",
    "Deadline": "1/15/2026",
    "Associated institution": "Purdue University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Internships in Science & Technology (SIST)",
    "Description of Internship": "The Summer Internships in Science & Technology (SIST) program offers undergraduate sophomores and juniors majoring in physics, engineering (mechanical, electrical and computer), materials science, mathematics, and computer science the opportunity to conduct research with Fermilab scientists and engineers.",
    "Online link to internship": "https://internships.fnal.gov/fursi/",
    "Location": "FermiLab",
    "Deadline": "1/15/2026",
    "Associated institution": "US department of Energy",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Quantitative Sciences Undergraduate Research Experience (QSURE)",
    "Description of Internship": "The QSURE internship program is designed for motivated undergraduate students with a passion for quantitative science. Each student will be paired with an expert mentor to work on an individual, data-driven research project that aims to answer pressing questions in cancer. The program will provide hands-on skills in biostatistics, epidemiology, health outcomes, and/or computational oncology.",
    "Online link to internship": "https://www.mskcc.org/departments/epidemiology-biostatistics/quantitative-sciences-summer-undergraduate-research-experience-qsure",
    "Location": "NYC",
    "Deadline": "1/19/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "MSRP (MIT Summer Research Program)",
    "Description of Internship": "The MIT Summer Research Program (MSRP) seeks to promote the value of graduate education; to improve the research enterprise through increased diversity; and to prepare and recruit the best and brightest for graduate education at MIT. This program focuses on research in Biological Sciences, Biomedical Sciences, & Neuroscience. The program takes place June 9 – August 9, 2025",
    "Online link to internship": "https://oge.mit.edu/msrp/application/",
    "Location": "Masachussets Institute of Technology",
    "Deadline": "1/20/2026",
    "Associated institution": "Masachussets Institute of Technology",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Mickey Leland Energy Fellowship (MLEF) Program",
    "Description of Internship": "The Mickey Leland Energy Fellowship (MLEF) Program provides students with educational opportunities to gain real-world, hands-on research experience with the Department of Energy’s (DOE) Office of Fossil Energy. The MLEF program was created in 1995 with the goal of improving opportunities for under-represented and minority students in science, technology, engineering, and mathematics (STEM) fields. All eligible candidates are encouraged to apply.",
    "Online link to internship": "https://orise.orau.gov/mlef/",
    "Location": "Oak Ridge, TN",
    "Deadline": "1/20/2026",
    "Associated institution": "Oak Ridge Institute",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The OHSU Equity Research Program",
    "Description of Internship": "The OHSU Equity Research Program offers an exciting opportunity for diverse undergraduate college students to spend eight weeks working on research projects alongside faculty, scientists and graduate students.",
    "Online link to internship": "https://www.ohsu.edu/diversity-equity-inclusion-belonging/equity-research-program",
    "Location": "OHSU's campus",
    "Deadline": "1/23/2026",
    "Associated institution": "Oregon Health & Science University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "UM-SMART Undergrad Summer Program",
    "Description of Internship": "UM-SMART is designed for undergraduate students who have an interest in obtaining a combined MD/PhD degree leading to a career in academic medicine as a physician-scientist performing basic research relevant to human health and disease. As a UM-SMART summer research fellow, students work full-time in a basic research laboratory under the mentorship of a research faculty member.",
    "Online link to internship": "https://medschool.umich.edu/programs-admissions/md-phd-program/um-smart-undergrad-summer-program",
    "Location": "Ann Arbor, Michigan",
    "Deadline": "1/23/2026",
    "Associated institution": "University of Michigan Medical School",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Student Program",
    "Description of Internship": "Students are required to attend the entire program. Students with date conflicts are encouraged to apply despite the conflicts; JAX staff will assist admitted students in negotiating early release, early finals, etc., to facilitate their on-time participation in the program. Students with significant date conflicts - such as early departure for overseas study - are encouraged to delay their application for another year.",
    "Online link to internship": "https://www.jax.org/education-and-learning/high-school-students-and-undergraduates/learn-earn-and-explore/admission",
    "Location": "Various Locations",
    "Deadline": "1/26/2026",
    "Associated institution": "The Jackson Laboratory",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Cancer Research Summer Internship Program",
    "Description of Internship": "To expose college students to cutting-edge research in cancer biology including: genetics, stem cells, biomarkers, DNA damage and repair.",
    "Online link to internship": "https://medicine.umich.edu/dept/cancer-biology/cancer-research-summer-internship-program",
    "Location": "U-M Medical and NCRC Campus, Ann Arbor, MI",
    "Deadline": "1/26/2026",
    "Associated institution": "University of Michigan",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "National Science Foundation Research Experience for Undergraduates (NSF REU)",
    "Description of Internship": "These are some of the questions that students will investigate in our REU: Computational Methods for Understanding Music, Media, and Minds. They will explore an exciting, interdisciplinary research area that combines machine learning, audio engineering, music theory, and cognitive science. Students will be mentored by faculty members drawn from Computer Science, Electrical and Computer Engineering, Brain and Cognitive Science, the program in Digital Media Studies, and the Eastman School of Music.",
    "Online link to internship": "https://www.sas.rochester.edu/dsc/undergraduate/reu.html",
    "Location": "Rochester, NY",
    "Deadline": "1/29/2026",
    "Associated institution": "The University of Rochester",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "UC Irvine’s Summer Undergraduate Research Fellowship (SURF)",
    "Description of Internship": "UC Irvine’s Summer Undergraduate Research Fellowship (SURF) program offers undergraduate and master’s diversity students an opportunity to work closely with faculty mentors on research projects and provides an intense course of graduate preparation workshops. SURF is designed for students who plan to pursue a Ph.D. or M.F.A. degree and enter academic careers, provides the tools needed to facilitate application, admission, and enrollment to graduate school. The SURF program is open to virtually all academic fields at UC Irvine.",
    "Online link to internship": "https://grad.uci.edu/about-us/diversity/grad-prep-programs/surf.php",
    "Location": "Irvine, CA",
    "Deadline": "1/30/2026",
    "Associated institution": "UCI Graduate Division",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experience for Undergraduates (REU)",
    "Description of Internship": "The Research Experience for Undergraduates (REU) Program is funded by the National Science Foundation to support twelve highly qualified students to undertake supervised research projects in the Department of Physics and Astronomy, for a period of 10 weeks each summer. This year the program will run from June 2 to August 7, 2021. Suggested travel days are June 1 and August 7. It is possible that the research will have to be done remotely. That will not be known until spring 2021.",
    "Online link to internship": "https://www.sas.rochester.edu/pas/undergraduate/reu/index.html",
    "Location": "Rochester, NY",
    "Deadline": "1/30/2026",
    "Associated institution": "The University of Rochester",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Summer Internship Program (SIP)",
    "Description of Internship": "The Summer Internship Program (SIP) provides experience in biomedical and/or public health research to students from diverse backgrounds - including students from racial/ethnic groups underrepresented in science and medicine, students from low-income/underserved backgrounds, and students with disabilities. The program provides research exposure for students interested in potential careers in science, medicine and public health.",
    "Online link to internship": "https://www.hopkinsmedicine.org/som/pathway/sip",
    "Location": "Baltimore, Maryland",
    "Deadline": "1/30/2026",
    "Associated institution": "Johns Hopkins University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Public Health Scholars Program",
    "Description of Internship": "The Summer Public Health Scholars Program (SPHSP) is designed for undergraduate students and its goal is to increase interest in and knowledge of public health and biomedical science careers. The program is designed for undergraduates entering their junior or senior year and recent baccalaureate degree students who are undecided about their career goals.",
    "Online link to internship": "https://www.publichealth.columbia.edu/academics/non-degree-special-programs/pathway-programs/summer-public-health-scholars-program/application-eligibility-selection",
    "Location": "Columbia University Irving Medical Center",
    "Deadline": "1/31/2026",
    "Associated institution": "Columbia University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "AEA Summer Training Program and Scholarship Program",
    "Description of Internship": "AEASP is a prestigious program that enables students to develop and solidify technical skills in preparation for the rigors of graduate studies. As many as 20% of PhDs awarded to minorities in economics over the past 20 years are graduates of the program. All students receive 2 months of intensive training in microeconomics, math, econometrics and research methods with leading faculty. At 3 credits per class, students have the opportunity to earn 12 college credits.",
    "Online link to internship": "https://www.aeaweb.org/about-aea/committees/aeasp",
    "Location": "Washington, D.C.",
    "Deadline": "1/31/2026",
    "Associated institution": "Howard University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Summer Institute in Biomedical Informatics (SIBMI)",
    "Description of Internship": "The Summer Institute in Biomedical Informatics (SIBMI), now entering its 17th year, is for undergraduates with quantitative interests and skills who aspire to contribute to translational advances in biomedicine with a future PhD or research-oriented MD or MD/PhD.",
    "Online link to internship": "https://dbmi.hms.harvard.edu/education/summer-institute-biomedical-informatics",
    "Location": "Boston, Massachusetts",
    "Deadline": "1/31/2026",
    "Associated institution": "Harvard Medical School",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "University of Victoria Exchange",
    "Description of Internship": "The University of Victoria is British Columbia's third largest research university. The main campus is located in the Gordon Head area of Greater Victoria, and the total campus spans nearly 403 acres. Founded in 1903, it serves a population of 20,000 students and is internationally recognized for its excellent academic programs and research. UVic is the nation's leading insitution on deep-water seafloor observatory practices, and is home to several interdisciplinary research centers including the Pacific Institute of Mathematical Studies, Compute Canada, and Canadian Oceans Research Universities.",
    "Online link to internship": "https://studyabroad.washington.edu/index.cfm?FuseAction=Programs.ProgramDiscovery&search=%5B%7B%22filterType%22:%22programDiscoveryKeyword%22,%22filterValues%22:%5B%7B%22value%22:%22Victoria,%22%7D,%7B%22value%22:%22British%22%7D,%7B%22value%22:%22Columbia%22%7D%5D%7D%5D",
    "Location": "Victoria, British Columbia",
    "Deadline": "1/31/2026",
    "Associated institution": "University of Victoria",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "CIEE Open Campus Block Program in Sydney",
    "Description of Internship": "Head to the land down under and discover the breathtaking biodiversity and laid-back lifestyle of this continent-sized country. Even better, experience Sydney your way by customizing your study abroad term on the Open Campus Block Program. Take one, two, or three six-week blocks, select your courses from a wide range of subject areas. In Sydney, you’ll enjoy one of the world’s most livable and friendliest cities with easy access to outdoor activities and iconic beaches.  Stay in Sydney the entire time or spend other blocks at our Global Institute locations in Berlin, Buenos Aires, Cape Town, Copenhagen, London, Madrid, Yucatán, Monteverde, Paris, Rio de Janeiro, Rome, Santiago, and Shanghai.",
    "Online link to internship": "https://studyabroad.washington.edu/index.cfm?FuseAction=Programs.ProgramDiscovery&search=[{%22filterType%22:%22programDiscoveryKeyword%22,%22filterValues%22:[{%22value%22:%22sydney%22}]}]",
    "Location": "Sydney, Australia",
    "Deadline": "1/31/2026",
    "Associated institution": "University of Washignton",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Systemics Institute",
    "Description of Internship": "Participants will conduct research with their chosen advisor on a project relating to the discipline of the advisor and student. The program begins with a week-long field trip to the Pepperwood Preserve in Sonoma County where students will participate in workshops on natural history field methods and science communication, before traveling to the Bodega Marine Lab to participating in the annual Snapshot Cal Coast Bioblitz.",
    "Online link to internship": "https://www.calacademy.org/summer-systematics-institute",
    "Location": "San Francisco, California",
    "Deadline": "1/31/2026",
    "Associated institution": "California Academy of Sciences",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "UCLA Public Health Scholars Training Program",
    "Description of Internship": "The UCLA Public Health Scholars Training Program provides undergraduate students the opportunity to explore the field of public health through hands-on training, structured workshops, group excursions, and leadership and professional development. Located in Los Angeles, the program offers scholars the opportunity to train at UCLA, to explore public health in one of the most diverse counties in the US, and to experience the city’s vibrant culture",
    "Online link to internship": "https://ph.ucla.edu/prospective-students/ucla-public-health-scholars-training-program",
    "Location": "Los Angeles, California",
    "Deadline": "1/31/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Future Public Health Leaders Program",
    "Description of Internship": "The University of Michigan Future Public Health Leaders Program (Michigan FPHLP) is a residential summer program funded by the Centers for Disease Control and Prevention (CDC). Through field placements, skill building workshops and mentorship, Michigan FPHLP provides students with opportunities for growth, learning and awareness in the field of public health. The ultimate goal of the program is to increase the diversity of the public health workforce and the people committed to reducing health disparities.",
    "Online link to internship": "https://sph.umich.edu/fphlp/application/#application",
    "Location": "University of Michigan school of public health",
    "Deadline": "1/31/2026",
    "Associated institution": "University of Michigan",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The JHU BioREU",
    "Description of Internship": "The JHU BioREU is a Research Experiences for Undergraduates Site funded by the National Science Foundation. The 10-week summer program is designed to provide an intensive, mentored research experience for undergraduates, especially those attending institutions with limited research opportunities.",
    "Online link to internship": "https://bio.jhu.edu/undergraduate/undergraduate-research/jhu-bioreu/",
    "Location": "Department of Biology at Johns Hopkins University",
    "Deadline": "1/31/2026",
    "Associated institution": "Johns Hopkins University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "NSF REU Programs at Scripps Research",
    "Description of Internship": "This NSF Research Experiences for Undergraduates (REU) Site award to Scripps Research located in La Jolla, CA, supports the training of 10 students in a 10-week program that probes the structure and function of macromolecules. This program offers its diverse participants an academic structure that integrates cutting-edge research with professional skills development and faculty mentoring.",
    "Online link to internship": "https://education.scripps.edu/undergraduate/summer-research/surf-program/",
    "Location": "La Jolla, California",
    "Deadline": "2/1/2026",
    "Associated institution": "Scripps Research Education and training",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Multicultural Access to Research Training (SMART)",
    "Description of Internship": "This summer you will have the opportunity to complete and present a research project, and take part in weekly workshops that will prepare you for graduate school. SMART is designed to help you define your educational and career goals, and we hope that many of you will become the faculty and researchers of tomorrow. We need your talent and diverse points of view to contribute to our nation’s college classrooms and scholarly efforts.",
    "Online link to internship": "https://www.colorado.edu/initiative/cdi/undergraduate-stem-research/smart-program-information#initiative/cdi/undergraduate-stem-research/smart-program-information/dates-events-deadlines",
    "Location": "Boulder, Colorado",
    "Deadline": "2/1/2026",
    "Associated institution": "University of Colorado Boulder",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Amgen Scholars Program",
    "Description of Internship": "The Yale Biomed Amgen Scholars Program is a research-intensive summer training program in biomedical research for undergraduate students who plan to obtain a Ph.D. or M.D./Ph.D. in the biomedical sciences. We particularly encourage students who are members of groups underrepresented in the sciences, who are the first in their families to college, who are from inner city or rural communities, or who have grown up with financial or other disadvantage to apply.",
    "Online link to internship": "https://amgenscholars.com/university/yale-university/",
    "Location": "New Haven, Connecticut",
    "Deadline": "2/1/2026",
    "Associated institution": "Yale University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Department of Genome Sciences",
    "Description of Internship": "The Department of Genome Sciences, in partnership with the National Science Foundation, provides summer research opportunities for undergraduate students. We are looking for students who aspire to enroll in either PhD or MD / PhD programs after their undergraduate studies.",
    "Online link to internship": "https://www.gs.washington.edu/academics/summer/gssummer/index.htm",
    "Location": "Various Locations",
    "Deadline": "2/1/2026",
    "Associated institution": "UW Genome",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Rosetta Commons",
    "Description of Internship": "Interns in this geographically-distributed REU program have the opportunity to participate in research using the Rosetta Commons software. The Rosetta Commons software suite includes algorithms for computational modeling and analysis of protein structures. It has enabled notable scientific advances in computational biology, including de novo protein design, enzyme design, ligand docking, and structure prediction of biological macromolecules and macromolecular complexes.",
    "Online link to internship": "https://www.rosettacommons.org/about/intern",
    "Location": "various lab locations",
    "Deadline": "2/1/2026",
    "Associated institution": "Rosetta Commons",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Neuroscience Undergraduate Research Opportunity (NURO)",
    "Description of Internship": "The Neuroscience Graduate Department hosts the REU Site: Summer Intensive Research Experiences in Neuroscience (SIREN) program. This 10 week program, provides undergraduate students with a research experience in the areas of behavioral and systems neuroscience, cognitive neuroscience, molecular and cellular neuroscience, developmental neuorscience, sensory neuroscience, computational neuroscience, and clinical neuroscience.",
    "Online link to internship": "https://medschool.umich.edu/interdisciplinary-programs/neuroscience-graduate-program/summer-research-opportunities/nuro-program",
    "Location": "Ann Arbor, Michigan",
    "Deadline": "2/1/2026",
    "Associated institution": "University of Michigan, Neuroscience Graduate Program",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Fellowship",
    "Description of Internship": "The Chemers Neustein Summer Undergraduate Research Fellowship (SURF) program provides a unique opportunity for undergraduates to conduct laboratory research at The Rockefeller University. SURF students work with leading scientists in a broad range of areas including biochemistry; structural biology and chemistry; molecular, cell and developmental biology; immunology; virology and microbiology; neuroscience; physics; and mathematical biology.",
    "Online link to internship": "https://www.rockefeller.edu/education-and-training/surf/",
    "Location": "New York City, New York",
    "Deadline": "2/1/2026",
    "Associated institution": "Rockefeller University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "SSRP-Amgen Scholars Program (Stanford Summer Research Program)",
    "Description of Internship": "The SSRP-Amgen Scholars Program is a fully-funded research-intensive residential program that takes place on Stanford’s beautiful campus for a nine-week period. Participants are matched with a member of Stanford’s distinguished faculty and work in one of our state-of-the-art research facilities.",
    "Online link to internship": "https://biosciences.stanford.edu/pathways/ssrp-amgen-scholars-program/#:~:text=The%20SSRP%2DAmgen%20Scholars%20Program,%2Dthe%2Dart%20research%20facilities.",
    "Location": "Stanford, California",
    "Deadline": "2/1/2026",
    "Associated institution": "Stanford University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate Research Opportunity Consortium (UROC)",
    "Description of Internship": "Students begin the program in the spring semester and enroll in a 3 unit reading and writing intensive course to strengthen your academic skills. You will work with the UROC Instructional Team on completing the first portion of a written research report which includes a review of relevant literature to better define your research interests.",
    "Online link to internship": "https://grad.arizona.edu/uroc/uroc-application-2020",
    "Location": "Tucson, Arizona",
    "Deadline": "2/1/2026",
    "Associated institution": "The University of Arizona",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experiences for Undergraduates",
    "Description of Internship": "Haystack Observatory invites all interested undergraduate students to apply for our paid summer research positions in science, engineering, and computer science.",
    "Online link to internship": "https://www.haystack.mit.edu/haystack-public-outreach/research-experiences-for-undergraduates-reu/",
    "Location": "Westford, Massachusetts",
    "Deadline": "2/1/2026",
    "Associated institution": "MIT Haystack Observatory",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "RESEARCH EXPERIENCE FOR UNDERGRADUATES IN COMPUTATIONAL SENSING and MEDICAL ROBOTICS (CSMR REU)",
    "Description of Internship": "The REU program in Computational Sensing and Medical Robotics(CSMR) is an intensive, ten-week program of laboratory research and instruction, beginning at the end of May and concluding in early August. Projects are available in Electrical and Computer Engineering, Mechanical Engineering, Biomedical Engineering and Computer Science. Students are awarded a $5,000 stipend and are given housing for the summer.",
    "Online link to internship": "https://lcsr.jhu.edu/education/summer-reu-program/",
    "Location": "Baltimore, Maryland",
    "Deadline": "2/1/2026",
    "Associated institution": "Johns Hopkins University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Indisciplinary Summer Undergraduate Research Program (Mollecular and Cellular Biology)",
    "Description of Internship": "The purpose of the BSURP is to provide talented undergraduate bioscience majors with direct laboratory research experience under the mentorship of research faculty members, to introduce them to the challenges and rewards provided by a research career, and to showcase the outstanding biomedical research training opportunities at the University of Iowa.",
    "Online link to internship": "https://grad.uiowa.edu/biomedical-scholars-summer-undergraduate-research-program",
    "Location": "Iowa City, IA",
    "Deadline": "2/1/2026",
    "Associated institution": "IOWA Graduate College",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Fellowship in Oceanography for Minority Undergraduates",
    "Description of Internship": "Preference is given to students studying in any of the fields of science or engineering including but not limited to the fields of biology, chemistry, engineering, geology, geophysics, mathematics, meteorology, physics, oceanography, and marine policy.",
    "Online link to internship": "https://www.whoi.edu/what-we-do/educate/undergraduate-programs/summer-student-fellowship/ssf-admissions/?pid=8065",
    "Location": "Chicago, Illinois",
    "Deadline": "2/1/2026",
    "Associated institution": "National Accelerator Laboratory",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Kenan Fellows Undergraduate Internship Program",
    "Description of Internship": "The Kenan Fellows Undergraduate Internship Program broadly explores 1). chemical reactivity and diversity as tools to probe biochemical structure and function, and 2). the connection of molecular and cellular structure with complex organismal phenomena such as aging, metabolism, learning and memory.",
    "Online link to internship": "https://education.scripps.edu/undergraduate/summer-research/other-programs/kenan-fellows-internship-program/index.html",
    "Location": "Jupiter, Florida",
    "Deadline": "2/1/2026",
    "Associated institution": "Scripps Research Education and training",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Multicultural Access to Research Training (SMART)",
    "Description of Internship": "The Summer Multicultural Access to Research Training (SMART) program is intended for undergraduate students who are interested in preparing for graduate degrees in science, math and engineering. SMART offers students the opportunity to conduct research under the guidance of a faculty mentor, and participate in workshops designed to strengthen scientific writing and oral presentation skills.",
    "Online link to internship": "https://www.colorado.edu/initiative/cdi/undergraduate-stem-research/smart-program-information/dates-events-deadlines",
    "Location": "Boulder, Colorado",
    "Deadline": "2/1/2026",
    "Associated institution": "University of Colorado Boulder",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Molecular Imaging Summer Program (MISP)",
    "Description of Internship": "The Molecular Imaging Summer Program (MISP) at Memorial Sloan Kettering offers undergraduate students hands-on research experience in cutting-edge laboratories and the opportunity to interact with research and clinical faculty and trainees. Molecular imaging is one of the most rapidly advancing specialties in medicine and MSK has established a vibrant and state-of-the-art laboratory-based translational molecular imaging research program, in addition to a world-class clinical research and care operation.",
    "Online link to internship": "https://www.mskcc.org/education-training/high-school-college/molecular-imaging-summer-program",
    "Location": "Various in NY state",
    "Deadline": "2/2/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "NYC Minority Summer Undergraduate Collaborative Research Program",
    "Description of Internship": "At NYU Grossman School of Medicine, our Vilcek Institute of Graduate Biomedical Sciences offers qualified college students who have completed their sophomore or junior year the opportunity to participate in our Summer Undergraduate Research Program, also known as SURP. If you are interested in pursuing a PhD or MD/PhD in the biomedical sciences, our research internship program can provide you with an inside glimpse into life beyond your undergraduate studies.",
    "Online link to internship": "https://med.nyu.edu/research/vilcek-institute-graduate-biomedical-sciences/summer-undergraduate-research-program",
    "Location": "New York , New York",
    "Deadline": "2/2/2026",
    "Associated institution": "New York University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Gerstner Sloan-Kettering Graduate School Summer Undergraduate Research Program",
    "Description of Internship": "Our 10-week Summer Undergraduate Research Program (SURP) begins on June 7 and ends on August 13, 2021. The program is designed for approximately 20 outstanding undergraduate freshmen, sophomores, and juniors interested in pursuing a career in biomedically related sciences.",
    "Online link to internship": "https://www.mskcc.org/education-training",
    "Location": "New York City, New York",
    "Deadline": "2/2/2026",
    "Associated institution": "Gerstner Sloan Kettering Graduate School of Biomedical Sciences",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate summer research experience in neuroscience",
    "Description of Internship": "Each component of the WUSTL ENDURE program is designed to provide trainees a solid foundation for future success. This begins with hypothesis-driven research in a world-class Washington University lab where students gain research skills and a taste of life as a graduate student.",
    "Online link to internship": "https://endure.wustl.edu/apply/",
    "Location": "St. Louis, Missouri",
    "Deadline": "2/2/2026",
    "Associated institution": "Washignton University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Brandeis Materials Research Science and Engineering Center (MRSEC)",
    "Description of Internship": "10 weeks of hands-on research in a Brandeis MRSEC laboratory. $5,000 stipend per student. Free housing and allowances for meals and travel Grad school preparation, faculty mentoring, professional development and social engagement with other students on campus",
    "Online link to internship": "https://www.brandeis.edu/mrsec/education/reuoverview.html",
    "Location": "Waltham, Massachusetts",
    "Deadline": "2/2/2026",
    "Associated institution": "Brandeis University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Program at NYU",
    "Description of Internship": "At NYU Grossman School of Medicine, our Vilcek Institute of Graduate Biomedical Sciences offers qualified college students who have completed their sophomore or junior year the opportunity to participate in our Summer Undergraduate Research Program, also known as SURP. If you are interested in pursuing a PhD or MD/PhD in the biomedical sciences, our research internship program can provide you with an inside glimpse into life beyond your undergraduate studies.",
    "Online link to internship": "https://med.nyu.edu/research/sackler-institute-graduate-biomedical-sciences/summer-undergraduate-research-program",
    "Location": "New York, NY",
    "Deadline": "2/2/2026",
    "Associated institution": "New York University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Tri-Institutional Chemical Biology Summer Program (ChBSP)",
    "Description of Internship": "The Tri-Institutional Chemical Biology Summer Program (ChBSP) is offered jointly by the Tri-Institutional PhD Program in Chemical Biology and the Office of Science Education & Training at Memorial Sloan Kettering Cancer Center. This ten-week program is generously supported by the Sanders Innovation & Education Initiative of the Tri-Institutional Therapeutics Discovery Institute.",
    "Online link to internship": "http://chembio.triiprograms.org/about-tpcb/summer-internship/",
    "Location": "New York, New Yor",
    "Deadline": "2/2/2026",
    "Associated institution": "Cornell University, Rockefeller University, Memorial Sloan Kettering cancer center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Health Professions Education Program (SHPEP)",
    "Description of Internship": "For a quarter of a century, the Summer Medical and Dental Education Program has successfully empowered students to realize their dreams in health and health care. The free, six-week academic enrichment program has created a pathway for more than 22,000 participants, opening the doors to life-changing opportunities.",
    "Online link to internship": "https://www.shpep.org/application-process/admission-timeline/",
    "Location": "virtual",
    "Deadline": "2/2/2026",
    "Associated institution": "Robert Wood Johnson foundation",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Engineering Summer Program (ESP)",
    "Description of Internship": "Memorial Sloan Kettering and Weill Cornell Medicine are pleased to invite applications for the 2021 Engineering Summer Program (ESP). ESP is designed to bring together undergraduate rising sophomores, juniors, and seniors interested in engineering and biomedicine for a summer research experience in labs at MSK or Weill Cornell (change to Memorial Sloan Kettering or Weill Cornell Medicine). Applicants must have a background in engineering, physical sciences, computational, or related fields.",
    "Online link to internship": "https://www.mskcc.org/education-training/high-school-college/engineering-summer-program",
    "Location": "Various in NY state",
    "Deadline": "2/2/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Chemical Biology Summer Program (ChBSP)",
    "Description of Internship": "The Tri-Institutional PhD Program in Chemical Biology and the Office of Science Education & Training at Memorial Sloan Kettering Cancer Center are very pleased to invite applications for the 2021 Chemical Biology Summer Program (ChBSP). This 10-week program is designed to bring outstanding chemistry, biochemistry, and chemical biology undergraduate rising sophomores, juniors, and seniors interested in pursuing a career at the intersection of chemistry and biomedicine for a research experience on the Weill Cornell, Memorial Sloan Kettering, and Rockefeller University campuses. Applicants must have chemistry experience.",
    "Online link to internship": "https://www.mskcc.org/education-training/high-school-college/chemical-biology-summer-program-chbsp",
    "Location": "Various in NY state",
    "Deadline": "2/2/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Program (SURP)",
    "Description of Internship": "The Louis V. Gerstner, Jr. Graduate School of Biomedical Sciences, Memorial Sloan Kettering Cancer Center, sponsors a ten-week research program for outstanding undergraduate students who are interested in pursuing a career in the biomedical sciences.",
    "Online link to internship": "https://www.sloankettering.edu/gerstner/summer-undergraduate-research",
    "Location": "Various in NY state",
    "Deadline": "2/2/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Tri-Institutional PhD Program in Computational Biology & Medicine (CBM)",
    "Description of Internship": "Students will partner with faculty  from Memorial Sloan Kettering, Weill Cornell, or Rockefeller University who have expressed a strong interest in working with students with computational skill sets. The faculty listed below are conducting research in diverse areas of biomedical sciences, and will welcome the added expertise provided by computationally-trained undergraduates.",
    "Online link to internship": "https://www.mskcc.org/education-training/high-school-college/computational-biology-summer-program-cbsp",
    "Location": "Various",
    "Deadline": "2/2/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "JHU Paradim REU",
    "Description of Internship": "NSF (National Science Foundation) funds a large number of research opportunities for undergraduate students through its REU Sites program. An REU Site consists of a group of ten or so undergraduates who work in the research programs of the host institution. Each student is associated with a specific research project, where he/she works closely with the faculty and other researchers. Students are granted stipends and, in many cases, assistance with housing and travel.",
    "Online link to internship": "https://www.paradim.org/reu/jhu",
    "Location": "Various (may include outside of US)",
    "Deadline": "2/2/2026",
    "Associated institution": "various including John Hopkins & Cornell University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Princeton Neuroscience Institute (PNI)",
    "Description of Internship": "PNI's program is for highly motivated visiting undergraduates who are interested in pursuing a graduate degree in neuroscience or a related field. PNI provides education and hands-on research experience and participants collaborate closely with students and faculty at PNI on original research projects and gain invaluable first-hand experience on what it is like to be a neuroscientist.",
    "Online link to internship": "https://pni.princeton.edu/apply/undergraduate-summer-interns",
    "Location": "Princeton, New Jersey/ may be virtual",
    "Deadline": "2/3/2026",
    "Associated institution": "Princton Nuroscience Institute",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Dartmouth's Academic Summer Undergraduate Research Experience",
    "Description of Internship": "The program is approximately eight weeks long, starting mid-June. In addition to providing valuable lab experience, ASURE will provide: Ethics seminars GRE prep Lab training Opportunities to present work/poster sessions",
    "Online link to internship": "https://graduate.dartmouth.edu/diversity/asure",
    "Location": "Hanover, New Hampshire",
    "Deadline": "2/3/2026",
    "Associated institution": "DartmoutH College",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Gateways to the Laboratory Program",
    "Description of Internship": "The Tri-Institutional MD-PhD Program is training physician-scientists who will become the next generation of leaders in biomedical research. Weill Cornell Medicine, The Rockefeller University, and Memorial Sloan Kettering Cancer Center combine to form one of the few inter-institutional collaborations dedicated to joint MD and PhD training.",
    "Online link to internship": "https://theleadershipalliance.org/summer-research-early-identification-program",
    "Location": "Ithaca, New York",
    "Deadline": "2/3/2026",
    "Associated institution": "Cornell University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "U.S. Department of Homeland Security (DHS) Summer Research Team (SRT) Program",
    "Description of Internship": "The purpose of the U.S. Department of Homeland Security (DHS) Summer Research Team (SRT) Program is to increase and enhance the scientific leadership at Minority Serving Institutions (MSIs) in research areas that support the mission and goals of DHS.",
    "Online link to internship": "https://orise.orau.gov/dhseducation/srt/default.html",
    "Location": "Various locations",
    "Deadline": "2/3/2026",
    "Associated institution": "Homeland security",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Nursing Program: School of Nursing",
    "Description of Internship": "This program offers nursing undergraduates in their junior year with outstanding academic potential the opportunity to work on research projects with School of Nursing faculty mentors. It is designed for students who plan to pursue the PhD degree and enter academic careers in nursing. Program includes stipend, on-campus housing, meal allowance, funds toward roundtrip transportation cost, GRE test preparation, formal and informal discussion on career options and other activities.",
    "Online link to internship": "https://medschool.ucla.edu/education/pre-med-pre-health-opportunities/shpep",
    "Location": "Los Angeles, California",
    "Deadline": "2/5/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Cornell NanoScale Science & Technology Facility Research Experience for Undergraduates (CNF REU)",
    "Description of Internship": "The undergraduates taking part in these ten-week programs will receive hands-on research experience. The projects are designed and supervised by faculty and technical staff. Interns then work with their assigned faculty and graduate students on their project, using the unique resources offered by each program. A convocation is held in August to allow interns the opportunity to present their work to their peers in a concise scientific presentation. Interns also must complete a written report, akin to a research paper, summarizing the findings of their research project. These reports are published and distributed to the interns and sites, the National Science Foundation (NSF), and many others.",
    "Online link to internship": "https://www.cnf.cornell.edu/education/reu",
    "Location": "Ithaca, New York",
    "Deadline": "2/6/2026",
    "Associated institution": "Cornell University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Beneficial Insects Protection REU",
    "Description of Internship": "The goal of our REU program is: (1) teach and nurture interest in science (2) to teach the students how to communicate science to scientists and the public through training and hands-on experiences, (3) foster skills in students for developing extension education materials including innovative uses of online apps, social media, and other technological tools to reach broad audiences, and (4) to significantly impact the career decisions of these students by providing academic research experiences and field trips to businesses and organization engaged in research and extension around beneficial insects.",
    "Online link to internship": "https://www.mskcc.org/education-training/summer-student",
    "Location": "New York, New york ( may go virtual)",
    "Deadline": "2/6/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Biomedical Engineering REU",
    "Description of Internship": "The goal of every medical practitioner is to improve quality of life for patients. Biomedical engineering and devices are instrumental in achieving this. The primary focus in each summer research project is biomedical devices designed to enhance medical care through science and engineering, with emphasis in two areas: (1) devices for diagnostics and sensing and (2) devices for therapeutics and intervention.",
    "Online link to internship": "https://www.mskcc.org/education-training/summer-student",
    "Location": "New York. New York",
    "Deadline": "2/6/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Student Program",
    "Description of Internship": "The Human Oncology and Pathogenesis Program (HOPP) hosts a Summer Student Program designed for high school students who are interested in pursuing careers in the biomedical sciences. The program enables students to take part in developing and presenting independent research projects, extracurricular activities, training, and more.",
    "Online link to internship": "https://www.mskcc.org/education-training/high-school-college/hopp-summer-student",
    "Location": "Various including NYC",
    "Deadline": "2/6/2026",
    "Associated institution": "Memorial Sloan Kettering Cancer Center",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "DAGSI Research Fellowship",
    "Description of Internship": "The AFRL/DAGSI Ohio Student-Faculty Research Fellowship program, funded primarily by Ohio Department of Higher Education (ODHE), supports science and engineering graduate students and faculty who conduct research in areas targeted by the Air Force Research Laboratory at Wright Patterson Air Force Base.",
    "Online link to internship": "https://www.soche.org/dagsi/apply/",
    "Location": "Dayton, Ohio",
    "Deadline": "2/7/2026",
    "Associated institution": "DAGSI",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The CLIMB Program",
    "Description of Internship": "CLIMB UP (Undergraduate Program) for Summer Research is an interdisciplinary, 10-week long summer research program for undergraduates to conduct research in the biomedical, behavorial, and health sciences. The CLIMB UP program provides research mentoring and career and professional development tailored to the goals of each of its divisions defined by research themes and sources of funding. Students explore graduate and career opportunities, discuss and present their research, network, and participate in social activities.",
    "Online link to internship": "https://ubgradconnect.buffalo.edu/register/?id=de1c018f-045a-4e2d-9354-864e5fed5567",
    "Location": "Buffalo, New York",
    "Deadline": "2/9/2026",
    "Associated institution": "University at Buffalo",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experiences for Undergraduates",
    "Description of Internship": "The National Science Foundation (NSF) and Established Program to Stimulate Competitive Research (EPSCoR) funded Collaborative Approaches among Scientists and Engineers (CASE) Research Experience is a 10-week research program for undergraduates located at Auburn University. Field and laboratory research projects are available for students majoring in STEM disciplines including chemistry, biology, physics, and all branches of engineering.",
    "Online link to internship": "http://www.auburn.edu/cosam//departments/diversity/reu.htm",
    "Location": "Auburn, Alabama",
    "Deadline": "2/9/2026",
    "Associated institution": "Auburn University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate Research Scholar Designation (URSD)",
    "Description of Internship": "The Undergraduate Research Scholar Designation (URSD) recognizes a student’s commitment to their development as a researcher during their undergraduate career. The URSD appears in the awards section of the transcripts of graduating students. URSD awardees receive a white research cord from the Office of Undergraduate Research to wear at convocation and commencement.",
    "Online link to internship": "https://our.utah.edu/undergraduate-research-scholar-designation/",
    "Location": "Salt Lake City, Utah",
    "Deadline": "2/10/2026",
    "Associated institution": "The University of Utah",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Research Experience for Undergraduates",
    "Description of Internship": "Students will participate in professional development activities focusing on preparing for graduate school and research related careers. They will also participate in peer networking and social activities. Successful REU applicants will be paired with a faculty mentor from a core CEM department (Physics, Materials Science & Engineering, Electrical & Computer Engineering, and Chemistry) and will perform experimental or computational research projects aligned with CEM focal areas.",
    "Online link to internship": "https://btaa.org/resources-for/students/srop/how-to-apply",
    "Location": "Columbus, Ohio",
    "Deadline": "2/10/2026",
    "Associated institution": "the Ohio State University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "SROP (Summer Research Opportunities Program)",
    "Description of Internship": "The goal of the program is to increase the number of underrepresented students who pursue graduate study and research careers. SROP helps prepare undergraduates for graduate study through intensive research experiences with faculty mentors and enrichment activities.",
    "Online link to internship": "https://apps.btaa.org/srop/apply",
    "Location": "Ten Academic alliance Universities",
    "Deadline": "2/10/2026",
    "Associated institution": "Alliance Universities (University of Illinois, Indiana University, University of Iowa, etc.)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Summer Research Opportunity Program (SROP)",
    "Description of Internship": "The Summer Research Opportunity Program (SROP) is a seven-week remote competitive research experience hosted by Northwestern University for sophomores and juniors from colleges and universities across the United States. All fields of research at Northwestern are open to SROP participants including the social sciences and humanities, physical sciences, chemical and biological sciences, technology, math, and engineering fields.",
    "Online link to internship": "Summer Research Opportunity Program: The Graduate School - Northwestern University",
    "Location": "remote (online)",
    "Deadline": "2/10/2026",
    "Associated institution": "Northewestern University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Northwestern University Materials Research Science & Engineering Center Research Experience for Undergraduates (REU) program",
    "Description of Internship": "REU students will have the opportunity to contribute to a research project led by a center faculty member and will participate in interdisciplinary research group meetings, expanding their science and engineering experience into a range of fields.",
    "Online link to internship": "https://mrsec.northwestern.edu/education/undergraduate-opportunities.html",
    "Location": "Stanford, California",
    "Deadline": "2/13/2026",
    "Associated institution": "Stanford University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Marine Sciences Summer Program",
    "Description of Internship": "Supported by a grant from the National Science Foundation’s Division of Ocean Sciences, this Research Experiences for Undergraduates (REU) program offers undergraduates in STEM an opportunity to conduct guided research internships in marine science. The summer 2021 program will run for 10 weeks from Monday, June 7 to Friday, August 13. Student support includes a $6,400 stipend, free housing, and travel assistance for the 10-week program.",
    "Online link to internship": "https://www.udel.edu/academics/colleges/ceoe/community/summer-opportunities/marine-sciences-summer-program/",
    "Location": "Newark, Delaware",
    "Deadline": "2/13/2026",
    "Associated institution": "University of Delaware",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Training and Experimentation in Computational Biology (TECBio)",
    "Description of Internship": "TECBio focuses on computational, quantitative, and systems-level, research over multiple scales. Research topics at various scales include computational analyses of protein dynamics and binding (molecular scale), computer modeling and simulation of signal transduction pathways (subcellular/cellular scale), automated image analysis and reconstruction (cellular/tissue scale), and genomic and metagenomic studies of variation in tissues and organs as well as between organisms and within populations (tissue/organ/organismal/population scale).",
    "Online link to internship": "http://www.tecbioreu.pitt.edu/",
    "Location": "remote (online)",
    "Deadline": "2/13/2026",
    "Associated institution": "University of Pittsberg",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Pathways Undergraduate Researchers",
    "Description of Internship": "Interns spend the majority of the nine-week session under the guidance of a mentor in a Fred Hutch research group. During the first week, interns meet as a cohort for an orientation to the program and to learn laboratory safety and hands-on research techniques. The remaining eight weeks focus on mentored research activities, which interns present to the Fred Hutch community on the final day of the program.",
    "Online link to internship": "https://www.fredhutch.org/en/education-training/undergraduate-students/pathways-undergraduate-researchers.html",
    "Location": "Seattle, Washington",
    "Deadline": "2/13/2026",
    "Associated institution": "Fred Hutch",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Materials Research Science and Engineering Center (MRSEC) REU",
    "Description of Internship": "Part of MRSEC’s mission is to provide research experiences and opportunities to faculty and students from outside UNL. This is your opportunity to become involved in one of our research thrusts, which include:",
    "Online link to internship": "https://mrsec.columbia.edu/content/research-experiences-undergraduates-reu",
    "Location": "Various",
    "Deadline": "2/13/2026",
    "Associated institution": "Columbia University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "UMN MRSEC Summer Undergraduate Research Programs",
    "Description of Internship": "The MRSEC Research Experiences for Undergraduates (REU) program provides summer undergraduate research opportunities in science and engineering. The University of Minnesota MRSEC will provide up to 25 full-time summer research positions to undergraduate students through the REU program during the summer of 2021.",
    "Online link to internship": "http://www.mrsec.umn.edu/ehr/REU/",
    "Location": "Various",
    "Deadline": "2/15/2026",
    "Associated institution": "Various",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Integrated Biological Sciences Summer Research Program for Undergraduates",
    "Description of Internship": "Program participants live close to campus and perform full-time research for 10 weeks under the guidance of trained research mentors. Weekly professional development seminars allow participants to learn from each other's experiences and contextualize their research projects within the overarching theme of predicting phenotype. Additional events and activities build community, support career and graduate school exploration, and help students build useful skills, such as science writing. Students present their projects at a final symposium and write research reports to summarize their findings.",
    "Online link to internship": "https://wiscience.wisc.edu/IBS-SRP",
    "Location": "West Lafayette, Indiana",
    "Deadline": "2/15/2026",
    "Associated institution": "Perdue University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "2025 Summer REU: Food, Energy, and Water Security",
    "Description of Internship": "The Mississippi State University Chemistry Department seeks applicants for an interdisciplinary NSF-supported summer Research Experience for Undergraduates (REU) program occurring in 2021. Students who have completed their freshman year of college and who have not yet graduated can participate fully in the Food, Energy and Water Security Summer Research Program activities and work on a research project under the direction of a faculty mentor.",
    "Online link to internship": "https://www.odu.edu/honors/research",
    "Location": "Starkville, Mississippi",
    "Deadline": "2/15/2026",
    "Associated institution": "Mississippi State University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Experiences (SURE)",
    "Description of Internship": "A summer research experience for undergraduate students from May 28, 2024 - August 3, 2024. Participants will spend ten weeks conducting laboratory research in an area of engineering or the physical sciences.",
    "Online link to internship": "https://gers.engr.wisc.edu/sure/#:~:text=Summer%20Undergraduate%20Research%20Experience%20(SURE)&text=Students%20are%20exposed%20to%20other,activities%20with%20current%20graduate%20students.",
    "Location": "The University of Wisconsin-Madison",
    "Deadline": "2/15/2026",
    "Associated institution": "The University of Wisconsin-Madison",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Water Quality in the Yucatan Peninsula",
    "Description of Internship": "This National Science Foundation-funded research program is open to undergraduates with an interest in water science. Eight students will take part in faculty-mentored research projects in and around Cancun, Mexico.  The eight-week program will be divided into three parts. Part one will be completed at the NIU campus in DeKalb, IL, where you will learn research skills, develop research plans, and study water resources and the Yucatan Peninsula. During this time you will be provided with accommodation on campus.",
    "Online link to internship": "https://www.niu.edu/ese/reu/",
    "Location": "DeKalb,Illinois",
    "Deadline": "2/15/2026",
    "Associated institution": "The Northern Illinois University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research in Science and Engineering (RISE)",
    "Description of Internship": "RISE at Rutgers is a nationally acclaimed summer research program for outstanding undergraduates from diverse backgrounds. Scholars participate in 10 weeks of cutting-edge research in the biological, physical, and social/ behavioral sciences, math, engineering, and exciting interdisciplinary areas under the guidance of carefully matched faculty mentors. A comprehensive professional development component, including GRE preparation, complements the research.",
    "Online link to internship": "http://rise.rutgers.edu",
    "Location": "New Brunswick, New Jersey",
    "Deadline": "2/15/2026",
    "Associated institution": "Rutgers/UMDNJ",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Cell and Molecular Biology",
    "Description of Internship": "The MU Life Sciences Fellows Program is actively seeking to diversify their graduate program application pool. Preference will be given to students interested in applying to PhD programs in the life sciences at MU. Applicants are expected to have completed at least one year of full-time college enrollment prior to June 2021, be pursuing a major in biology, biochemistry, microbiology, or related field, and be a citizen or permanent resident of the U.S. Interns selected for this program will conduct research with faculty mentors who are members of the NIGMS T32 Training Grant at MU.",
    "Online link to internship": "https://undergradresearch.missouri.edu/summer/",
    "Location": "Columbia, Missouri",
    "Deadline": "2/15/2026",
    "Associated institution": "University of Missouri-Columbia",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Research Internship Program Alcohol Research",
    "Description of Internship": "The Department of Psychological Sciences at the University of Missouri (MU) hosts a diverse cadre of psychologists dedicated to research into the etiology and course of alcoholism and related disorders. MU-ARTSS professors represent a wide array of expertise in the science of alcohol and addiction including genetics, personality, psychopathology, social and affective neuroscience, and social network analysis.",
    "Online link to internship": "https://psychology.missouri.edu/research/mu-artss",
    "Location": "Columbia, Missouri",
    "Deadline": "2/16/2026",
    "Associated institution": "University of Missouri-Columbia",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Committee on Institutional Cooperation Summer Research Opportunities Program (SROP)",
    "Description of Internship": "The goal of the program is to increase the number of underrepresented students who pursue graduate study and research careers. SROP helps prepare undergraduates for graduate study through intensive research experiences with faculty mentors and enrichment activities.",
    "Online link to internship": "https://www.graddiv.ucsb.edu/ucsb-csu-sri",
    "Location": "off- campus",
    "Deadline": "2/16/2026",
    "Associated institution": "National Institutes of Health (NIH)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "UM-SANSA International Research Experience for Students (IRES)",
    "Description of Internship": "The University of Michigan and South African National Space Agency (SANSA) Space Weather International Research Experience for Students (IRES) program (UM-SANSA-IRES or MSI for short) will support 18 students (six per year) spending the northern hemisphere summer (8-weeks) at the SANSA Space Science Directorate located in Hermanus, South Africa working on a variety of space weather science and engineering projects. The students will be paired with SANSA scientists, engineers and post-docs to provide one-on-one research mentoring and will participate in the annual “Space Weather Winter School” held by SANSA in June and July.",
    "Online link to internship": "https://clasp.engin.umich.edu/academics/undergraduate-research/um-sansa/",
    "Location": "Various locations",
    "Deadline": "2/16/2026",
    "Associated institution": "University of Michigan",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Research Opportunities Program (SROP)",
    "Description of Internship": "The University of Illinois at Urbana-Champaign offers a summer research program that provides undergraduate students from populations underrepresented in graduate study at Illinois with an opportunity to explore careers in research. The program at Illinois provides students with an experience that will help strengthen their knowledge, skills, and understanding of graduate school.",
    "Online link to internship": "https://grad.illinois.edu/diversity/srop",
    "Location": "remote (online)",
    "Deadline": "2/17/2026",
    "Associated institution": "Illinois Graduate College",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Future Forward Internship Academy",
    "Description of Internship": "Applicants must be full-time, matriculated students at a regionally accredited college or university, or one recognized by the New York State Education Department as following acceptable educational practices. Students must be in the process of completing their sophomore, junior or senior year of college at the time of application. All majors will be considered. Space is limited; therefore, timely submission of application and required documents is essential.",
    "Online link to internship": "https://www.osc.ny.gov/jobs/interns",
    "Location": "New York, New York",
    "Deadline": "2/17/2026",
    "Associated institution": "NY State Comptroller",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Internship Program (SIP) Research and Training Opportunities",
    "Description of Internship": ": Summer programs at the National Institutes of Health (NIH) provide an opportunity to spend a summer working at the NIH side-by-side with some of the leading scientists in the world, in an environment devoted exclusively to biomedical research (At the NIH biomedical research includes everything from behavioral and social sciences, through biology and chemistry, to physics, mathematical modeling, computational biology, and biostatistics).",
    "Online link to internship": "https://www.training.nih.gov/research-training/pb/sip/",
    "Location": "Virtual",
    "Deadline": "2/18/2026",
    "Associated institution": "US Department of health and human Services",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Caltech SURF Program",
    "Description of Internship": "SURF provides an opportunity to explore other fields. SURF is not just a summer job; a project should have significant intellectual and creative content. The benchmark for a suitable project is the potential for publication in the refereed literature.",
    "Online link to internship": "https://sfp.caltech.edu/undergraduate-research/programs/surf/application_information",
    "Location": "Caltech",
    "Deadline": "2/22/2026",
    "Associated institution": "California Institute of Technology",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Program in Molecular and Quantitative and Computational Biology",
    "Description of Internship": "Each summer, the Department of Molecular Biology and Lewis-Sigler Institute for Integrative Genomics(link is external) provide intensive laboratory research experiences to Princeton students. Each student joins a world-class research group—headed by a Faculty member and carries out an original research project.",
    "Online link to internship": "https://molbio.princeton.edu/undergraduate/research/summer-research",
    "Location": "Princeton, New Jersey",
    "Deadline": "2/23/2026",
    "Associated institution": "Princeton University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research at the University of Kansas",
    "Description of Internship": "Key components of this program are career enhancement and educational activities that encourage and prepare the students for graduate studies and careers in emerging and interdisciplinary areas of the chemical sciences (the current focus is sustainability in chemistry).",
    "Online link to internship": "https://mb-reu.ku.edu/",
    "Location": "Lawrence, Kensas",
    "Deadline": "2/27/2026",
    "Associated institution": "University of Kansas",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "NASA Paid Undergraduate Research",
    "Description of Internship": "Interns use their creativity and innovataion to work on projects impacting NASA's missions, such as returning to the moon by 2024. As a NASA intern, you will be part of an amazinng team that is dedicated to space exploration.",
    "Online link to internship": "https://www.nasa.gov/learning-resources/internship-programs/",
    "Location": "NASA various locations",
    "Deadline": "2/27/2026",
    "Associated institution": "NASA",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "NASA supported Internships",
    "Description of Internship": "NASA internships and fellowships leverage NASA’s unique missions and programs to enhance and increase the capability, diversity and size of the nation’s future science, technology, engineering and mathematics (STEM) workforce. Internships are available from high school to graduate level. Internships provide students with the opportunity to participate in either research or other experiential learning, under the guidance of a mentor at NASA.",
    "Online link to internship": "https://intern.nasa.gov/?_ga=2.153297784.1567773931.1607366322-19225799.1607366322",
    "Location": "Various locations",
    "Deadline": "2/27/2026",
    "Associated institution": "NASA",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Chemistry REU",
    "Description of Internship": "This REU offers a wide range of topics, including organic radicals, biochemical sensors, chemical biology, catalytic nanoparticles, drug-protein interactions, graphene nanoribbons, metabolomics, protein-RNA interactions, and RNA structure. The faculty advisors bring strong records of commitment to one-on-one mentoring of undergraduates in their research laboratories, and each brings their own multidisciplinary approach, specific research objectives, and experimental methods.",
    "Online link to internship": "https://srp.unl.edu/Application",
    "Location": "Various",
    "Deadline": "3/1/2026",
    "Associated institution": "University of Nebraska",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Profile For Success",
    "Description of Internship": "PFS targets college juniors, seniors, recent graduates, or individuals making a career transition who are on track to enter dental school the academic year following their participation. Preparation for the DAT is the main focus of this program. Participants will spend the majority of their time in test preparatory classes or facilitated study groups. In addition to test preparation, students participate in admissions workshops, simulated clinical and lab experiences, panel discussions on health disparities and lectures about various careers in dentistry.",
    "Online link to internship": "https://dent.umich.edu/education/profile-success",
    "Location": "Ann Arbor, Michigan",
    "Deadline": "3/1/2026",
    "Associated institution": "U. Michigan, College of Literature, Science, and the Arts",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Delaware IDeA Network of Biomedical Research Excellence",
    "Description of Internship": "The Delaware INBRE Summer Scholars Program is an undergraduate summer research program sponsored through the National Institutes of Health (NIH) – National Institute of General Medical Sciences (NIGMS) through funding to the Delaware INBRE program. In a partnership with six state institutions, including Christiana Care Health System, Delaware Technical Community College, Delaware State University, Nemours/A.I. duPont Hospital for Children, the University of Delaware and Wesley College, selected undergraduate students are able to carry out independent research projects while studying full-time under a mentor to gain knowledge of research techniques and making unique scholarly or original impacts to the biomedical sciences. Regional summer opportunities are available in Vermont, Maine, New Hampshire & Rhode Island.",
    "Online link to internship": "https://de-inbre.org/dissp/",
    "Location": "Delaware INBRE Tower at STAR 100 Discovery Blvd Newark, DE 19713, USA",
    "Deadline": "3/1/2026",
    "Associated institution": "Delaware INBRE",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Minority Access Inc., Internship Program",
    "Description of Internship": "The Minority Access National Internship Program is designed to allow talented undergraduate and graduate students experience the diversity and scope of career opportunities available in the federal, state and local government and participating private business entities. The program allows students to merge academic theory with the experience they are learning in the workplace.",
    "Online link to internship": "http://www.minorityaccess.org/intern",
    "Location": "Virtual or in-person",
    "Deadline": "3/1/2026",
    "Associated institution": "Minority Access, Inc",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Applied Plant System REU",
    "Description of Internship": "The goal of this program is to prepare students with both knowledge and skills necessary to address the grand challenges of food production and the environment. Participating students will conduct a summer experiential internship related to his or her career interests and goals, choosing from a variety of programs in the applied plant, soil, and environmental sciences available through a network of collaborators.",
    "Online link to internship": "https://srp.unl.edu/Application",
    "Location": "University of Nebraska- Lincoln",
    "Deadline": "3/1/2026",
    "Associated institution": "University of Nebraska- Lincoln",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "B.I.G Summer (Bruins in Genomics) Summer Research Program for Undergraduates and Masters Students",
    "Description of Internship": "Bruins-in-Genomics (B.I.G.) Summer offers a comprehensive program of interactive learning, hands-on training, and career building opportunities for undergraduates interested in quantitative and computational biology. Their program’s unique integration of computer science and life science material models how real scientists collaborate with each other in today’s increasingly interdisciplinary world of biomedical and life science research.",
    "Online link to internship": "https://qcb.ucla.edu/big-summer/",
    "Location": "Los Angeles, California",
    "Deadline": "3/1/2026",
    "Associated institution": "University of California-Los Angeles",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Unmanned Systems Foundations and Applications REU",
    "Description of Internship": "REU students will participate in carefully prepared research projects on unmanned systems with topics including unmanned aerial vehicle control, behavior studies of robots in complex environments around humans, characterizing and developing vehicles for atmospheric profiling, and asset management during wildfires with unmanned aerial vehicles. Research activities across the projects will be structured to provide a systematic research experience for the cohort, while enabling flexibility for each participant to focus on a particular area.",
    "Online link to internship": "https://summerprogram.unl.edu/programs/applied-unmanned-systems/",
    "Location": "University of Nebraska-Lincoln's Nebraska Intelligent MoBile Unmanned Systems Lab (UNL NIMBUS)",
    "Deadline": "3/1/2026",
    "Associated institution": "University of Nebraska-Linkoln",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Virology REU",
    "Description of Internship": "As a selected student, you will design and implement a tailor-made research project. You will then conduct exciting and challenging experiments to test hypotheses under the guidance and mentoring of our expert faculty. As you are being trained in biomedical research, you will have the opportunity to explore cutting edge techniques and gain knowledge of the latest instrumentation by utilizing the equipment in our labs and the core facilities that provide support to our entire NCV faculty.",
    "Online link to internship": "https://srp.unl.edu/Application",
    "Location": "The Nebraska Center for Virology (NCV)",
    "Deadline": "3/1/2026",
    "Associated institution": "University of Nebraska-Linkoln",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Bruins-In-Genomics (B.I.G.) Summer Undergraduate Research Program",
    "Description of Internship": "Bruins-In-Genomics (B.I.G.) Summer Research Program is an 8-week full-time immersion program for undergraduates interested in learning how to read and analyze genes and genomes. Through this program students will have the opportunity to experience graduate-level coursework, and learn the latest cutting-edge research, tools and methods used by leading scientists to solve real-world problems.",
    "Online link to internship": "https://qcb.ucla.edu/big-summer/",
    "Location": "Los Angeles, California",
    "Deadline": "3/1/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Nebraska Summer Research Program",
    "Description of Internship": "This intensive summer research experience provides mentoring and research experiences while allowing scholars to preview graduate school life. Students with a strong interest in graduate programs are particularly encouraged to apply as are those from populations traditionally underrepresented in graduate education.",
    "Online link to internship": "https://summerprogram.unl.edu/",
    "Location": "Various",
    "Deadline": "3/1/2026",
    "Associated institution": "University of Nebraska- Linkoln",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Summer Research Opportunities Program (SROP)",
    "Description of Internship": "SROP isa gateway to graduate education at Michigan State University (MSU).The goal of the program at MSU is to increase the number of domestic undergraduate studentswho pursue graduate study and careers in teaching and researchat colleges and universities.MSU SROP helps prepare undergraduates for graduate study through intensive research experiences with faculty mentors and other professional developmentactivities.",
    "Online link to internship": "https://grad.msu.edu/srop/apply",
    "Location": "East Lansing, Michigan",
    "Deadline": "3/1/2026",
    "Associated institution": "The Pennsylvania State University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The U.S. Department of State’s Benjamin A. Gilman International Scholarship Program",
    "Description of Internship": "s of March 20, 2020, the worldwide Gilman Program was paused through the end of December 2020. As of January 1, 2021, the Gilman Program will again support travel under its long-standing policy of allowing students to study or intern in locations with Level 1 or Level 2 Travel Advisories only.",
    "Online link to internship": "https://www.gilmanscholarship.org/applicants/eligibility/",
    "Location": "Various",
    "Deadline": "3/5/2026",
    "Associated institution": "Benjamin A Gilman International scholarship",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate Research Opportunities Program (UROP",
    "Description of Internship": "The Undergraduate Research Opportunities Program (UROP) provides undergraduate students and mentors the opportunity to work together on research or creative projects.",
    "Online link to internship": "https://our.utah.edu/urop/",
    "Location": "Salt Lake City, Utah",
    "Deadline": "3/6/2026",
    "Associated institution": "The University of Utah",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "NASA JPL/Caltech (Jet Propulsion Lab at the California Intitute of Technology): Summer Program",
    "Description of Internship": "As part of their internships, students are partnered with JPL scientists or engineers, who serve as the students' mentors. Students complete designated projects outlined by their mentors, gaining educational experience in their fields of study while also contributing to NASA and JPL missions and science.",
    "Online link to internship": "https://www.jpl.nasa.gov/edu/intern/apply/summer-internship-program/",
    "Location": "NASA various locations",
    "Deadline": "3/13/2026",
    "Associated institution": "NASA",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "NFS REU Site in Cellular Bioengineering: From Biomaterials to stem cells",
    "Description of Internship": "When students apply to the RISE program at Rutgers, they are automatically quiclfiedf for this progra. With an intellectual focus in cellular Bioengineering, this program provides research opportunities that articulate with range of cutting edge, multidisplinary areasincluding stem cell engineering, systems and computational biology,cell active biomaterials, and micro/nanoscale biosystems.",
    "Online link to internship": "https://sites.rutgers.edu/celleng/",
    "Location": "New Brunswick, New Jersey",
    "Deadline": "3/15/2026",
    "Associated institution": "Rutgers/UMDNJ",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "REU Cellular Bioengineering: From Biomaterials to Stem Cells",
    "Description of Internship": "The next 3-year cycle of the program will continue to provide cutting-edge research opportunities, professional development activities, and exercises in innovation and entrepreneurship. In addition, a new emphasis on engineering to address health disparities will be introduced by the new co-director of the program, Professor Maribel Vazquez.",
    "Online link to internship": "https://sites.rutgers.edu/celleng/",
    "Location": "Piscataway, NJ",
    "Deadline": "3/15/2026",
    "Associated institution": "Rutgers University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate Research Opportunities Program (UROP)",
    "Description of Internship": "The Undergraduate Research Opportunities Program (UROP) provides University of Minnesota undergraduates from every college, major, and discipline, the opportunity to partner with a faculty member on research or creative projects.",
    "Online link to internship": "https://ugresearch.umn.edu/opportunities/urop",
    "Location": "Various",
    "Deadline": "3/16/2026",
    "Associated institution": "Various",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Research Internship in Medical Sciences",
    "Description of Internship": "The University of Missouri offers a summer research internship with the immediate objective of recruiting students with the ultimate goal of improving diversity in the biomedical sciences workforce. In a nine-week program (June 2 - July 30, 2021), you’ll work on your own research projects under the guidance of an MU School of Medicine faculty member and present results at a poster forum at the end of the session. You’ll learn how to write abstracts and design posters to prepare for the poster forum.",
    "Online link to internship": "https://medicine.missouri.edu/offices-programs/research/advisory-boards-and-committees/research-council/summer-fellowship",
    "Location": "Columbia, Missouri",
    "Deadline": "3/21/2026",
    "Associated institution": "University of Missouri-Columbia",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Student Research Internship",
    "Description of Internship": "The Scripps Research Translational Institute promotes cutting-edge translational research, focused on personalized health care through the genomic, proteomic and metabolomic correlates of health and disease. We additionally seek to advance personalized medicine through research incorporating mobile health (mHealth) monitoring of individuals’ symptoms and physiology.",
    "Online link to internship": "https://www.scripps.edu/science-and-medicine/translational-institute/education-and-training/student-research-internship/",
    "Location": "various",
    "Deadline": "3/30/2026",
    "Associated institution": "Scripps Research Education and training",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "BRI Summer Undergraduate Research Experience",
    "Description of Internship": "The UCLA Summer Programs for Undergraduate Research (SPUR) offer upper division undergraduate students with outstanding academic potential the opportunity to work closely with faculty mentors on research projects. The programs are designed for students who wish to learn more about the graduate school experience and possibly pursue an academic career in teaching and research. Opportunities are available in virtually all academic fields (e.g., arts, humanities, social sciences, life sciences, health sciences, physical sciences, etc.).",
    "Online link to internship": "https://grad.ucla.edu/admissions/diversity/summer-programs-for-undergraduate-research-spur/",
    "Location": "Los Angeles, CA",
    "Deadline": "3/31/2026",
    "Associated institution": "UCLA",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "2025 UCLA Summer Programs for Undergraduate & Graduate Research",
    "Description of Internship": "Founded in 1919 as the southern branch of the University of California, UCLA awarded its ﬁrst graduate degree fourteen years later to Helen Cecilia Benner. Since then, graduate studies at UCLA has blossomed into 133 degree programs—fertile ground for winners of everything from National Medals of Science to Pulitzer Prizes.",
    "Online link to internship": "https://grad.ucla.edu/asis/srp/srpform.asp",
    "Location": "Los Angeles, CA",
    "Deadline": "3/31/2026",
    "Associated institution": "UCLA",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Programs in Undergraduate Research (SPUR)",
    "Description of Internship": "The UCLA Summer Programs for Undergraduate Research (SPUR) offer upper division undergraduate students with outstanding academic potential the opportunity to work closely with faculty mentors on research projects. The programs are designed for students who wish to learn more about the graduate school experience and possibly pursue an academic career in teaching and research. Opportunities are available in virtually all academic fields (e.g., arts, humanities, social sciences, life sciences, health sciences, physical sciences, etc.).",
    "Online link to internship": "http://www.gdnet.ucla.edu/asis/srp/srpintro.htm",
    "Location": "Los Angeles, California",
    "Deadline": "3/31/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Mellon Mays Undergraduate Fellowship Writing and Research Training Program",
    "Description of Internship": "The Mellon Mays Undergraduate Fellowship Writing and Research Training Program at UCLA is an intensive writing and research program for 20 current Mellon Mays Fellows from participating Mellon Mays colleges and universities. Fellows participate in a rigorous scholarly writing and research methodology course, individual and group mentoring sessions, workshops, events, and a final research colloquium. The program also includes on-campus housing and a meal allowance.",
    "Online link to internship": "https://grad.ucla.edu/admissions/diversity/summer-programs-for-undergraduate-research-spur/",
    "Location": "Los Angeles, California",
    "Deadline": "3/31/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Diversity Project",
    "Description of Internship": "The Diversity Project is a 10-week research-intensive summer program funded by the UC-HBCU initiative and the National Science Foundation focused on increasing participation of underrepresented minority students in marine and evolutionary biology. Through fieldwork and laboratory training, students will learn an integrative approach towards the study of the ecology and biodiversity of coral reef ecosystems at the Gump South Pacific Research Station on the island of Mo’orea, French Polynesia.",
    "Online link to internship": "https://grad.ucla.edu/admissions/diversity/summer-programs-for-undergraduate-research-spur/",
    "Location": "Los Angeles, California",
    "Deadline": "3/31/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "California State University (CSU) Sally Casanova Pre-Doctoral Scholars Program",
    "Description of Internship": "This program is restricted to undergraduate and master’s-level students in the California State University Sally Casanova Pre-Doctoral Program. The Program is designed to increase the pool of potential university faculty by supporting the doctoral aspirations of CSU students who have experienced economic and educational disadvantages. Each of the selected CSU Sally Casanova pre-doctoral scholars works closely during the academic year with a CSU faculty sponsor to develop an overall plan leading ultimately to enrollment in a doctoral program.",
    "Online link to internship": "https://grad.ucla.edu/admissions/diversity/summer-programs-for-undergraduate-research-spur/",
    "Location": "Los Angeles, California",
    "Deadline": "3/31/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Community College Field Biology Alliance",
    "Description of Internship": "This is a 9-month research internship designed for community college students. Student interns are assigned a graduate and undergraduate research mentor and meet at UCLA on the first Saturday of each month from April to July to design a field biology based independent research project. In August we travel as a group to a remote field station for 10 days to enact the planned intern research projects. The program culminates with student research presentations.",
    "Online link to internship": "https://grad.ucla.edu/admissions/diversity/summer-programs-for-undergraduate-research-spur/",
    "Location": "Los Angeles, California",
    "Deadline": "3/31/2026",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Organization for Tropical Studies: Tropical Biology Course (Summer – Costa Rica)",
    "Description of Internship": "A summer research experience for undergraduate students from underrepresented minorities in STEM (Science, Technology, Engineering and Math). The program is designed to increase the appreciation of students own and that of other cultural backgrounds, improve student scientific literacy, to develop research skills, and to develop the motivation to expand their professional network while promoting the self-confidence to continue along a STEM career trajectory. Costa Rica’s unique diversity of ecosystems, from lowland tropical forests, to cloud forests, species rich wetlands, dry forests and diverse coastal systems will be your classroom as you study tropical ecology, conservation, methods in field research.",
    "Online link to internship": "https://tropicalstudies.org/course/costa-rica-tropical-biology/",
    "Location": "Costa Rica",
    "Deadline": "4/1/2026",
    "Associated institution": "Organization for Tropicall Studies",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "IES Abroad London Direct Enrollment - University College London",
    "Description of Internship": "Everything we do is about the IES Abroad student. Our profoundly passionate team of study abroad professionals believes in creating once-in-a-lifetime educational adventures that transcend expectations. Our goal is to rock the world of some 6,000 study abroad students every year. From our headquarters in Chicago to our 135+ study abroad programs in more than 35 global locations worldwide, we create authentic global education and life-affirming cultural experiences.",
    "Online link to internship": "https://studyabroad.washington.edu/index.cfm?FuseAction=Programs.ProgramDiscovery&search=[{%22filterType%22:%22programDiscoveryKeyword%22,%22filterValues%22:[{%22value%22:%22london%22}]}]",
    "Location": "London, United Kingdom",
    "Deadline": "4/1/2026",
    "Associated institution": "University of Washignton",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experiences for Undergraduates 2025",
    "Description of Internship": "CNMB basic philosophy is to have Research Experiences for Undergraduates (REU) students work on research projects, which are simple to comprehend and have some short-term achievable milestones, but simultaneously contribute to longer-term scientific goals and technological applications. These projects should not only be challenging but engaging to our REU participants so that they are motivated to learn more about the research area as well to seriously consider graduate studies.",
    "Online link to internship": "https://sites.uab.edu/cnmb/research-experiences-for-undergraduates/#:~:text=The%20NSF%20REU%20program%20is,accepting%20applications%20December%201%2C%202024.",
    "Location": "Birmingham, AL",
    "Deadline": "4/10/2026",
    "Associated institution": "The University Of Alabama at Birmingham",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "i-ETERN: International Undergraduate Research Fellowships",
    "Description of Internship": "this summer research program is focused on undergraduates, who are women and/or of racial origins that are under-represented in the field of Electrical Engineering. This follow-on program reflects the Center’s approach of continuous engagement in order to develop undergraduates for graduate studies in ultra-low energy nanoelectronics, nanomechanics, nanophotonics and nanomagnetics.",
    "Online link to internship": "https://e3s-center.berkeley.edu/education-diversity/education/undergraduate/ietern-international-undergraduate-research-program/",
    "Location": "Grenoble, France",
    "Deadline": "",
    "Associated institution": "Center of Energy Efficient Electronics science",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Undergraduate Research Experience in Chemistry & Biochemistry at the Hope College",
    "Description of Internship": "Through SHARP students conduct research with faculty mentors each summer. Students learn cutting edge research techniques, conduct literature reviews, attend seminars, and analyze data. At the same time they engage with other research students across campus with lunches, weekly ice cream socials, and other events planned by individual departments or divisio",
    "Online link to internship": "https://sharp.hope.edu/applicant/Instructions.asp",
    "Location": "Holland, Michigan",
    "Deadline": "",
    "Associated institution": "Hope College",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experiences for Undergraduates",
    "Description of Internship": "The University of Rochester is one of the smallest and most collegiate schools among the nation’s top research universities. Our goal is to develop students as researchers, collaborators, and mentors for academia and industry.",
    "Online link to internship": "http://www.rochester.edu/college/kearnscenter/undergraduate/reu/index.html",
    "Location": "Rochester, NY",
    "Deadline": "",
    "Associated institution": "The University of Rochester",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "CARE Science, Engineering and Math (SEM) Summer Research Program",
    "Description of Internship": "The Center for Academic & Research Excellence (CARE) SEM Summer Program offers hands-on research experience working in the laboratory of a distinguished UCLA faculty member. Students must identify a faculty research mentor who is willing to write a letter of recommendation for their application to the program.",
    "Online link to internship": "http://sciences.ugresearch.ucla.edu/",
    "Location": "Los Angeles, California",
    "Deadline": "",
    "Associated institution": "University of California Los Angeles (UCLA)",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The HACU National Internship Program - Corporate Component",
    "Description of Internship": "The HACU National Internship Program - Corporate Component, partners with some of the leading corporations in the nation to assist them in attracting and hiring the best talent from HACU member colleges and universities. The process is very competitive but rewarding, as many internships lead to full-time roles. Opportunities for both internships and full-time employment are available.",
    "Online link to internship": "https://www.hacu.net/hacu/Corporate_HNIP.asp",
    "Location": "Various",
    "Deadline": "",
    "Associated institution": "The Chmpions of Hispanic Success in Higher Education",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Missouri Louis Stokes Alliance for Minority Participation (MoLSAMP)",
    "Description of Internship": "This is a program specifically for students at Missouri LSAMP schools (University of Missouri – Columbia, Harris-Stowe State University, Lincoln University, Missouri State University, St. Louis Community College, Truman State University, University of Central Missouri, University of Missouri – St. Louis, and Washington University in St. Louis). Undergraduates from Alliance Schools selected for this program will live on campus in Columbia and conduct research for 9 weeks. This is a full-time program and students may NOT enroll in other coursework or hold part-time jobs. Students are expected to be in Columbia for the whole 9 weeks (no vacations); although, no activities are planned on weekends and students may go home if they wish.",
    "Online link to internship": "https://science.missouristate.edu/LSAMP/MO_Scholars_Cohort_2024.htm",
    "Location": "Columbia, Missouri",
    "Deadline": "",
    "Associated institution": "University of Missouri-Columbia",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "IES Abroad Auckland Direct Enrollment - University of Auckland",
    "Description of Internship": "Everything we do is about the IES Abroad student. Our profoundly passionate team of study abroad professionals believes in creating once-in-a-lifetime educational adventures that transcend expectations. Our goal is to rock the world of some 6,000 study abroad students every year. From our headquarters in Chicago to our 135+ study abroad programs in more than 35 global locations worldwide, we create authentic global education and life-affirming cultural experiences.",
    "Online link to internship": "https://studyabroad.washington.edu/index.cfm?FuseAction=Programs.ProgramDiscovery",
    "Location": "Auckland, New Zealand",
    "Deadline": "",
    "Associated institution": "University of Aukland",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Harvard Forest Summer Research Program in Ecology",
    "Description of Internship": "The Harvard Forest Summer Research Program in Ecology is an 11-week, immersive research experience that connects students, mentors, and researchers to pursue scientific inquiry in a field station setting.",
    "Online link to internship": "https://harvardforest.fas.harvard.edu/education/reu-apply",
    "Location": "Petersham, Massachusetts",
    "Deadline": "",
    "Associated institution": "Harvard University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "CSURP (Chemistry Summer Undergraduate Research Program)",
    "Description of Internship": "CSURP is a program for undergraduate students with an interest in majoring in chemistry or chemical engineering and would like experience in conducting supervised summer research. The program is supported by the NSF Center for Selective C-H Functionalization (CCHF), which is a network of 22 academic research laboratories at 15 partnering institutions throughout the country. The CCHF is one of eight National Science Foundation (NSF) funded Centers for Chemical Innovation.",
    "Online link to internship": "https://www.nsf.gov/funding/initiatives/reu/search",
    "Location": "Various",
    "Deadline": "",
    "Associated institution": "CSURP",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experiences for Undergraduates (REU)",
    "Description of Internship": "The Research Experiences for Undergraduates (REU) program supports active research participation by undergraduate students in any of the areas of research funded by the National Science Foundation. REU projects involve students in meaningful ways in ongoing research programs or in research projects specifically designed for the REU program. This solicitation features two mechanisms for support of student research: (1) REU Sites are based on independent proposals to initiate and conduct projects that engage a number of students in research.",
    "Online link to internship": "https://www.nsf.gov/funding/initiatives/reu/search",
    "Location": "Alexandria, Virginia",
    "Deadline": "",
    "Associated institution": "NSF",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Inroads/ New York City, Inc",
    "Description of Internship": "Internships lay the foundation for your future career. As an INROADS intern, you’re connected with some of the world’s leading industry innovators for paid – yes, paid– internships. You’ll be challenged academically and professionally, and we’ll give you the tools to rise to the occasion.",
    "Online link to internship": "https://inroads.org/internships-program/",
    "Location": "New York, New York",
    "Deadline": "",
    "Associated institution": "American Museum of Natural History",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Molecular Biology and Biochemistry of Plant Immunity against Biotic Stress REU",
    "Description of Internship": "Crop yield losses caused by plant disease are in the value of billions of dollars worldwide each year, which has made it an alarming threat to the food security in feeding a burgeoning global population. Understanding and eventually manipulating for crop improvement the key molecular mechanisms that plants use to defend against various pathogens are thus of considerable agricultural, economic, and social importance. Among the mechanisms pivotal for host defense is ubiquitination, a major post-translational protein modification process that occurs in plant, animal, and human cells.",
    "Online link to internship": "https://www.mskcc.org/research/ski/research",
    "Location": "New York, New York",
    "Deadline": "",
    "Associated institution": "Sloan-Kettering Graduate School of Biomedical Science",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Aninamal scienes research",
    "Description of Internship": "Coordinated by the MU Office of Undergraduate Research, the Summer Undergraduate Research Program hosts students from institutions across the nation. Interns in the program participate in educational and social activities creating a vibrant, inclusive, and welcoming summer community. Under the guidance of an MU faculty mentor, students work on their own projects in collaboration with graduate students, lab technicians, and post-doctoral researchers.",
    "Online link to internship": "https://undergradresearch.missouri.edu/",
    "Location": "Columbia, Missouri",
    "Deadline": "",
    "Associated institution": "University of Missouri-Columbia",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Research Experience for Undergraduates",
    "Description of Internship": "CCMR REU students work directly with faculty on interdisciplinary materials research projects involving chemistry, physics, materials science, and engineering disciplines. Students will also participate in an organized program of lectures, laboratory visits, and a variety of recreational activities. Applicants select their top five projects from a list of projects available in 2021.",
    "Online link to internship": "https://www.ccmr.cornell.edu/",
    "Location": "Ithaca, New York",
    "Deadline": "",
    "Associated institution": "Cornell Center for Materials Research",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Rutgers University pipeline- Initiative to maximize student development",
    "Description of Internship": "The Rutgers biological/biomedical science community offers many exciting opportunities for your undergraduate research, and we value and support a diverse community of scientists and scholars. Rutgers has breadth and depth in many areas, including: neuroscience, structural biology, genetics, basic molecular biology and biochemistry, biomedical engineering, cancer biology, immunology, virology, and nutritional sciences, among others.",
    "Online link to internship": "https://biology.rutgers.edu/research-showcase/get-involved-in-research",
    "Location": "New Brunswick, New Jersey",
    "Deadline": "",
    "Associated institution": "Rutgers University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "The Interdisciplinary Materials Research for Undergraduates and the Cornell Center for Materials Research",
    "Description of Internship": "CCMR REU students work directly with faculty on interdisciplinary materials research projects involving chemistry, physics, materials science, and engineering disciplines. Students will also participate in an organized program of lectures, laboratory visits, and a variety of recreational activities. Applicants select their top five projects from a list of projects available in 2021.",
    "Online link to internship": "https://www.ccmr.cornell.edu/",
    "Location": "Ithaca, New York",
    "Deadline": "",
    "Associated institution": "Cornell University",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "REU Site: Summer Intensive Research Experiences in Neuroscience (SIREN)",
    "Description of Internship": "The Neuroscience Graduate Department hosts the REU Site: Summer Intensive Research Experiences in Neuroscience (SIREN) program. This 10 week program, provides undergraduate students with a research experience in the areas of behavioral and systems neuroscience, cognitive neuroscience, molecular and cellular neuroscience, developmental neuorscience, sensory neuroscience, computational neuroscience, and clinical neuroscience.",
    "Online link to internship": "https://medschool.umich.edu/interdisciplinary-programs/neuroscience-graduate-program/summer-research-opportunities/siren-program",
    "Location": "Ann Arbor, Michigan",
    "Deadline": "",
    "Associated institution": "University of Michigan Medical School Neuroscience Graduate Program",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "Summer Undergraduate Research Program (SURP)",
    "Description of Internship": "Spanning 10 weeks, SURP at ISMMS offers undergraduate students with a strong background in science the opportunity to conduct intensive research across a variety of disciplines, in a vibrant, diverse, and nurturing environment. Consistent with the GSBS mission to support the innovative graduate education of tomorrow’s future leaders in biomedical sciences in a diverse, inclusive, equitable, and multidisciplinary learning environment, and in partnership with the Office for Diversity and Inclusion at the Mount Sinai Health System, we are committed to encouraging the participation of students from groups underrepresented in the biomedical sciences.",
    "Online link to internship": "https://icahn.mssm.edu/education/admissions/graduate-education/summer-undergraduate",
    "Location": "Mount Sinai",
    "Deadline": "",
    "Associated institution": "Icahn School of Medicine",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  },
  {
    "Name of the Internship": "UNAVCO RESESS (Research Experiences in Solid Earth Sciences for Students)",
    "Description of Internship": "RESESS is a summer internship program dedicated to increasing the diversity of students entering the geosciences.",
    "Online link to internship": "https://resess.unavco.org/apply/",
    "Location": "Boulder, Colorado",
    "Deadline": "",
    "Associated institution": "Boulder, CO",
    "Updated By": "AFZ (11/26/25)",
    "Valid": "Valid",
    "Promoted": ""
  }
]